[{"user":"Maxwell Souza","content":"😂 😂 😂 😂 😂 E tem gente que não pegou o trocadilho ainda e quer zoar 😂 😂 😂","datetime":"10/04/2019 18:51"},{"user":"Lidiane Monteiro","content":"Não se faz com curso da Udemy!","datetime":"10/04/2019 19:06"},{"user":"Lurian Correia","content":"Alguém poderia me dar um HELP?  Fiz um sistema, nada MUITO elaborado... usei php+mysqli e o bootstrap para estilizar.  Estava tudo bem, tudo ótimo, tudo lindo e maravilhoso rodando em todos os navs... porém, entretanto, todavia, de repente o bootstrap não está mais funcionando no lixo do IE e no fantasma do Firefox 🙄  Não está funcionando NADA do bootstrap, ficou horrível 😭 hahahaha  Por favor, alguém saberia como me ajudar? ... Alguém já passou por isso?  Alguém desconfia do que pode ser?  Obrigada a todos! ❤️ No Chrome funciona 😑 Ver mais","datetime":"10/04/2019 20:02"},{"user":"Everton Loffi","content":"[LINK] Post novo!","datetime":"09/04/2019 14:38"},{"user":"Klaus Andrade","content":"Tenho uma vaga para programador Laravel + VueJS em Portugal. [Empresa dinamarquesa] [Local: Portugal] [Idioma: Ingles.]... [Remoto: possibilidade de alguns dias, mas residindo em PT] Temos esse teste para ser aplicado, mas é um pouco extenso, podem compartilhar o conhecimento dos pontos principais e/ou agendarmos entrevista. Ver mais","datetime":"10/04/2019 17:09"},{"user":"Paulo Brito","content":"Chumbo grosso #aws #honeypot #servidores #web #ataques #hackers","datetime":"09/04/2019 19:34"},{"user":"Wilder Lopes","content":"","datetime":"10/04/2019 17:54"},{"user":"Lopes Carlos","content":"Pessoal domino html5(87%) css3(90%) php(9%) javascript(19%) java(5%) assim sou programador ? . Estas percentagem eu adiçionei de acordo com uque eu domino melhor e a meta e chegar nos 100%;","datetime":"10/04/2019 20:14"},{"user":"Jhonatan Souza","content":"😂👌🏽","datetime":"10/04/2019 20:29"},{"user":"Rafael Cr","content":"Seria uma ferramenta como essa o futuro do desenvolvimento front-end?","datetime":"10/04/2019 16:22"},{"user":"Rodrigo Portillo","content":"[BRADESCO - INTEGRAÇÃO] 😾Estou fazendo a integração com o boleto e transferência eletrônica do Bradesco. Boleto e consulta de pagamentos está funcionando normalmente, mas estou com problemas na transferência. Estou usando PHP e CURL.Ao chamar a transferência eu recebo um erro 440:Erro ao tentar construir a url de comunicacao com a loja para requisicao dos dados da compra.Estou seguindo totalmente a documentação, e parece estar tudo certo e, claro, entrei em contato com o supo...rte que apenas me respondeu: O erro é devido a URL de notificação estar apresentando o código 406 quando deve retornar 200 para confirmação da transação. 🤦‍♂️Alguém que já desenvolveu essa integração saberia me dizer como poderia resolver esse problema?-- obs: sei que nas regras diz que não pode compartilhar código na postagem, mas estou usando a nova ferramenta do Facebook própria para esse tipo de compartilhamento --  requisição{    \"merchant_id\": \"XXXXXXXXX\",    \"meio_pagamento\": \"800\",    \"pedido\": {        \"numero\": \"XXXXXXXXXXXXXXXX\",        \"valor\": \"300000\",        \"descricao\": \"XXXXXXXXXXXX.\"    },    \"comprador\": {        \"nome\": \"Rodrigo Oliveira Portillo\",        \"documento\": \"33333333333\",        \"endereco\": {            \"cep\": \"XXXXXXXXX\",            \"logradouro\": \"44444\",            \"numero\": \"S\\/N\",            \"complemento\": \"XXXXX\",            \"bairro\": \"XXXXXXXXXXX\",            \"cidade\": \"Recife\",            \"uf\": \"PE\"        },        \"ip\": \"170.245.65.74\",        \"user_agent\": \"Mozilla\\/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit\\/537.36 (KHTML, like Gecko) Chrome\\/73.0.3683.86 Safari\\/537.36\"    },    \"token_request_confirmacao_pagamento\": \"aaadde7f71ba682a67dff1b756d81340\"}resposta:{\t\"merchant_id\": \"xxxxxxxxxxxx\",\t\"meio_pagamento\": \"800\",\t\"pedido\": {\t\t\"numero\": \"xxxxxxxxxxxxxxx\",\t\t\"valor\": 300000,\t\t\"descricao\": \"XXXXXXXXXXXXXXXXXXXXXXX\"\t},\t\"transferencia\": null,\t\"status\": {\t\t\"codigo\": -440,\t\t\"mensagem\": \"Erro ao tentar construir a url de comunicacao com a loja para requisicao dos dados da compra.\",\t\t\"detalhes\": \"Erro ao tentar construir a url de comunicacao com a loja para requisicao dos dados da compra.\"\t}} Ver mais","datetime":"10/04/2019 19:26"},{"user":"Raulino Neto","content":"Cliente: entendeu bem o projeto? Dev: entendi sim","datetime":"10/04/2019 17:20"},{"user":"Neizy Mendez LM","content":"Como é a raiz quadrada em C#?? Ajuda galera","datetime":"06/04/2019 04:27"},{"user":"Mizael Souto","content":"https://cio.com.br/nao-tem-big-mac-sem-ti-diz-cio-do-mcdo…/…","datetime":"05/04/2019 11:06"},{"user":"Igor Cavour Oliveira","content":"https://www.facebook.com/olhardigital/videos/756816504692369/ e Roda windows, chupa linux! :v","datetime":"09/04/2019 16:10"},{"user":"David Matheus","content":"Vale a pena se formar em Sistemas de Informação e logo em seguida fazer Engenharia de Software? No caso eu aproveitaria a maioria das matérias que já fiz em SI e eliminaria em Engenharia, diminuindo muito a duração do curso. Recebi essa dica de um professor, mas não sei se vale a pena, ou se é mais válido fazer uma pós-graduação...","datetime":"05/04/2019 09:27"},{"user":"Erycky Rayner","content":"Galera, HTML, CSS e JavaScript é suficiente para Front End?","datetime":"10/04/2019 12:52"},{"user":"Bruno Santos","content":"Até que ponto uma graduação é importante na nossa carreira? Alguem formado em engenharia de software numa federal e alguém formado em engenharia de software em uma particular e ainda a distância não tem muita diferença ou recebem olhares diferentes do mercado? Ou a graduação é um mero formalismo em que de onde vem não faz tanta diferença?","datetime":"06/04/2019 06:22"},{"user":"Bieel Ribeiro","content":"Qual foi a mentira do mundo da programacão que mais te decepcionou quando voce descobriu a verdade? Me: \"Python é bom, facil e todo mundo usa. Vai conseguir emprego facil\"","datetime":"09/04/2019 08:47"},{"user":"Moacir Amaro","content":"{Procurei na web mas não vi nada explicatório} Galera como funciona o auxilio financeiro do coursera?  Estou entrando na plataforma agora, porem estou meio perdido em como ela funciona. Obrigado","datetime":"08/04/2019 20:06"},{"user":"Leo Cavalcante","content":"Quando você tenta ter tipagem estática, mas se lembra que é o PHP.","datetime":"09/04/2019 22:48"},{"user":"Pedro Da Drena SC","content":"Oi galera preciso que me ajudem a fazer um algoritimo em JAVA que calcula a raiz quadrada de um numero sem usar Math.sqrt por favor me ajudem","datetime":"10/04/2019 17:30"},{"user":"Elton Kamuango","content":"Qual é a da Estrutura de Dados? . Eu terei no próximo semestre, estou até a ficar assustado. 😂","datetime":"10/04/2019 16:42"},{"user":"Gabriel Ferreira","content":"Saiu a foto do buraco negro do profissional de TI","datetime":"10/04/2019 16:25"},{"user":"Matheus Signorini","content":"Boa tarde! Procuro alguem pra trabalhar comigo em projeto de game em base de tibia, (TFS) Quem tiver experiencia na area ou estiver interessado favor mandar pm Estou procurando alguem pra fazer parte do projeto, porem aceito freelances também entao pode deixar o contato ai embaixo... Estou desenvolvendo um Game MMORPG Dragon Ball Tenho cuidado de todas as areas sozinho até agora, estive junto a um programador, onde levei calote e a parte de programação ficou avulsa Tenho pequena experiencia na area de programação, porem, muito fraco em c++, preciso de um programador que conheça de Dragon Ball e tenha conhecimento na area de MMORPG Caso nunca tenha trabalhado com a base de tibia pode chamar também. Sobre o projeto Lore esta completa Toda a base teorica completa tambem Sprites do game 90% completa e unicas, foi investido bem nessa area Mapa do game esta cerca de 60% completo porem sujeito a modificações diaria Irei deixar algumas fotos do projeto embaixo quem quiser saber mais pode chamar. sim as fotos estao com qualidade ruim pra evitar ripp foram fotos que eu postava em foruns, e todas fotos foram tiradas offgame, a vista ingame é como tibia, com bem mais zoom in do que isso fico no aguardo, vlw Ver mais","datetime":"09/04/2019 15:50"},{"user":"Adriano Banga William Coragem","content":"Pessoal ajudam ali neste algoritmo. Fazer um programa que quarde dez número reais.","datetime":"10/04/2019 03:05"},{"user":"Clederson Cruz","content":"","datetime":"10/04/2019 19:19"},{"user":"Igor Igor","content":"Galera, uma duvida: Como eu gero um pdf personalizado a partir de uma compra em um e-commerce? Tipo venda de ingresso online. Não estou sabendo como começar a pesquisar sobre isso.","datetime":"10/04/2019 18:09"},{"user":"Gabriel Naufal Bastos","content":"Pessoal vocês conhecem algum site ou curso online para aprender a programar? Estou tendo dificuldades em aprender sozinho no youtube e com livros... Pode até ser algo pago, mas que ensine direitinho todos os processos!","datetime":"09/04/2019 02:54"},{"user":"Mauricio Ferraz","content":"E ae pessoal, eu estou querendo mesclar Js com php, só para fins didáticos mesmo, porém quando eu passo a variável do Js ela fica como string e quando eu converto ela para int no PHP ela fica com valor 0. Agradeço pela ajuda","datetime":"10/04/2019 16:23"},{"user":"Pablo Abreu","content":"Galera, uma dúvida, tem como fazer um aplicativo para ANDROID no delphi, que toca algum som automaticamente ? Por exemplo, tenho q ficar verificando meu banco de dados 24h por dia, se ao verificar, eu receber o valor \"alarme 2\" o aplicativo tem que emitir um barulho, mas não queria que ele tivesse que estar aberto ... Tem como fazer isso?  Obs: Um exemplo perfeito do que seria isso que to falando, é basicamente o despertador do celular, vc programa tudo nele lá e independente do que tu faça, reinicie o celular, feche o despertador... Sempre quando der a hora marcada ele irá abrir sobrepondo todos os apps automaticamente..","datetime":"09/04/2019 00:26"},{"user":"Cristiano De Magalhães Almeida","content":"Quem está começando pode ficar em dúvida: afinal o que é necessário pra ser um programador de sucesso no mercado? Uma das principais características que fizeram a diferença nos últimos 13 anos em que tenho trabalhado no mercado de TI é o aprendizado constante. A maneira mais simples de estar sempre atualizada é não permanecer mais que 2 anos na mesma empresa / projeto. Visitando com frequência o mercado é possível participar sempre de projetos desafiadores e com aprendizado c...ontínuo.  Uma habilidade que ajuda demais é o inglês. Como aprendi muito cedo - com 10 anos em uma escola com bolsa para pessoas menos afortunadas - fez uma baita diferença no dia a dia.  Mais insights sobre o mundo corporativo no vídeo abaixo:  #fullStack #developer #desenvolvedor #sistemasCorporativos #mercadoDeTrabalho #sucessoProfissional Ver mais","datetime":"10/04/2019 12:33"},{"user":"Alvaro Viebrantz","content":"Projetinho do final de semana: ESP32 acessando dados do YouTube via API e mostrando em um display TFT.  A programação foi feita usando Micropython, estava algum tempo querendo brincar com isso e esse foi meu primeiro projeto com micropython. Eu usei o Jupyter Notebook como \"IDE\" pra programar de forma mais interativa e foi uma experiência bem legal.  Repositório com código... http://github.com/alvarowolfx/esp32-youtube-display Pretendo fazer um vídeo essa semana com o passo a passo pra iniciar com Micropython e como foi o processo de prototipação e programação usando micropython. youtube.com/c/AlvaroViebrantz Ver mais","datetime":"08/04/2019 18:51"},{"user":"Filipe Mata Fmmk","content":"Pessoal agradeceria muito a vossa ajuda numa duvida, criei 6 textbox dois por cada alinea e o que acontece é o seguinte criei um botão com o nome operação e eu gostaria que houvesse uma sequencia para o preenchimento dos textbox por exemplo se usuario preenche-se um textbox tem que clicar no botão para guardar os dados e se por acaso ele não seguir a ordém ir preencher logo o último textbox vir uma mensagem de aviso. Agradeço a quem poder ajudar.","datetime":"09/04/2019 10:27"},{"user":"Robson Cristian Tomaz Pereira","content":"Um Método para Entender Profundamente Qualquer Assunto // até as linguagens de programação mais estranhas Richard Feynman, físico vencedor do Prêmio Nobel e pai da Computação Quântica, usava 4 passos para dominar os assuntos mais complicados do mundo:... 1. Escolha um assunto (ou conceito) Auto-explicativo. 2. Ensine – ou finja ensinar – para uma criança Aqui vem o cuidado com termos, presunções, enrolações... Obs: a pessoa que mais perde com seu auto-engano é você! 3. Identifique os “buracos” na própria compreensão Está explicando e algumas partes estão um pouco nebulosas, você não consegue explicar direito, então estude mais e reflita como ensinar melhor. 4. Revise, organize e simplifique Faça a lapidação, desenhe, crie mapas mentais, leia suas anotações em voz alta, qualquer coisa que precise para tornar o assunto simplão. #FicaDica para você conhecer mais sobre esse cara fora de série. Ele tem até uma passagem interessantíssima pelo Brasil. P.S: Em nenhum momento está escrito que é fácil seguir esses passos. Pegar um conceito complicado e deixá-lo simples é um negócio bem trabalhoso. Conheço programadores excelentes que não conseguem explicar o que fazem sem complicarem demais. Ver mais","datetime":"09/04/2019 13:38"},{"user":"Felipe Giovanni","content":"[JavaScript] Galera to com uma dúvida aqui. To começando a programar agora na faculdade e tenho uma lista de exercícios em java scrip. Basicamente é uma lista com exercícios de soma, subtração calculos básicos... ... a primeira função é de fazer A(B+C). Essa funciona normalmente dessa forma function  Calcular01(){  var A = document.getElementById(\"01A\").value;  var B = document.getElementById(\"01B\").value;   var C = document.getElementById(\"01C\").value;  var R = parseInt(A) * ( parseInt(B) + parseInt(C) );  document.getElementById(\"01resultado\").value = R; }   só que quando eu adiciono outra função essa primeira para de funcionar e eu nem encosto nela... eu tenho certeza que é algo muito idiota que estou deixando passar mas não faço ideia do que possa ser Ver mais","datetime":"09/04/2019 20:30"},{"user":"Fred Nora","content":"How people react when a new update of your OS is coming: Linux user: Cool, more free stuff! Mac user: Ooh I have to pay! Windows user: Ah not again!","datetime":"09/04/2019 13:51"},{"user":"Bruno Messias","content":"Sobre a foto do Buraco Negro. A imagem não é oriunda de apenas um telescópio, mas de vários epalhados pelo globo. Após caputrado o sinal em cada aparelho fica o problema de como unir os sinais de fontes distintas que  chegam em instantes de tempos distintos a tipos de receptores distintos.  Então,  um problema de astronomia se reduz a um problema de processamento de imagens. Então, embora digam que é um marco para física, acredito que também é marco para a computação.  https://arxiv.org/abs/1512.01413","datetime":"10/04/2019 12:27"},{"user":"Leo Lopez","content":"[REFLEXÃO/DÚVIDA] Ultimamente tenho observado que os meios da internet OU se transformam em 1. algo disruptivo, livre, aberto (startups); ou 2. burocrático, fechado e cheio de regras toscas. Há uns dias perguntei aqui algo sobre Wordpress - pois espera-se que num grupo onde tem programadores haverá alguém que possivelmente sanará minhas dúvidas - e enquanto um membro me ajudava, outro veio falar que aqui não era o grupo certo, devia procurar grupo de Wordpress. Ora, se eu que...ro ideias não tendenciosas, devo procurar quem conhece ideias/plataformas diferentes daquelas em que se põe um foco. Mas tentando evitar o caos, eis que me inscrevo num grupo de Wordpress. Uma das regras é: \"Não indicação de empresas de hospedagem\", quando era justamente minha dúvida. Não pra dizer qual a melhor, mas pra saber uma que pudesse ter um requisito que procuro. E agora, devo me inscrever num grupo/fórum da Hostinger, Hostgator??? Um segundo caso foi que criei uma conta na InfinityFree.net pra testar um site corporativo, e não posso configurar o domínio sem antes ter direcionado para seu DNS. Daí que uso a Registro.br e eles também não configuram para o DNS sem antes ter configurado no host. Mando e-mail para o suporte e tudo que fazem é afirmar o que o sistema já faz. Agora a dúvida: Conhecem host grátis que eu possa testar Wordpress e/ou domínio? Ver mais","datetime":"10/04/2019 19:24"},{"user":"Robson Cristian Tomaz Pereira","content":"Vocês deram uma olhada na pesquisa do Stack Overflow desse ano? https://insights.stackoverflow.com/survey/2019","datetime":"10/04/2019 07:37"},{"user":"Lucas Caresia","content":"Olá, eu tenho um arquivo mp3 de duas horas, e gostaria que esse arquivo se tornasse uma livestream, ou seja, todos que entrarem no site vão começar a ouvir no mesmo momento que os outros estão, como posso fazer isso ? Obs: preciso fazer isso em nodejs ou python. Abraço","datetime":"06/04/2019 16:58"},{"user":"Kardrean Shinoda","content":"Galera estou criando uma API com node/express, esta dando os valores setados pela porta, até ai blz, so que preciso ler um arquivo txt e passar ele pra json na url do localhost e esse arquivo se modifica constantemente na aplicação(sempre preciso o da data mais recente), alguém tem alguma dica  :/, se alguém puder me mandar um link sobre agradeço :3 (sim sou estagiário :/)","datetime":"09/04/2019 22:21"},{"user":"Maicon Madureira","content":"[OFF]Fala Galera,comprei uma placa de video RX 570 da Gigabyte,porem a placa so aceita conexoes HDMI,DP,DVI e meu monitor so tem saida VGA ai comprei um adaptador VGA/DVI-D e nao funcionou,como resolvo esse problema? Adaptador:","datetime":"10/04/2019 10:42"},{"user":"Mateus","content":"Fala Galere, tudo bem? Vou compartilhar umas vagas que estão disponíveis aqui na minha equipe, valeu. Vagas para Desenvolvedor Python/Django em São Paulo-SP... Deseja trabalhar no maior e-commerce de roupas da América Latina? Com uma equipe coesa e multi-disciplinar com softwares de Data Science, Machine Learning e automação de procedimentos internos? Requisitos para VAGA: - Python - Django - MySQL Desejável: - Docker - Conhecimentos de Libs de manipulação de dados Salários a partir de 4.000 do nível Júnior, porém o salário é negociável de acordo com a avaliação técnica. Vagas para Junior, Pleno e Sênior. Interessados enviar o currículo para mateus.vieira@dafiti.com.br Ver mais","datetime":"09/04/2019 11:02"},{"user":"Andreia Paim","content":"Pessoal, queria algumas ideias... estou fazendo um chat em php com jequery, mas nos que andei testando, ele atualiza a tela de forma que fica bastante desagradável. pois cada vez que ele traz a última mensagem, ele poe todas novamente. Não é bom. Qual seria a melhor logica para que aparecessem as novas mensagens de forma a não causarmos essa atualização do div. apenas aparecessem as novas.","datetime":"10/04/2019 15:50"},{"user":"Victor Mendonça Nogueira","content":"Até hoje sempre foquei meus estudos no universo Java, mas o destino quis que a Microsoft me fizesse sofrer mais ainda fazendo com que não apenas tenha que ser um usuário Windows como também estudar para ser um desenvolvedor. Net, gostaria que me passassem uma pequena lista de coisas pra eu aprender relacionada ao desenvolvimento com ferramentas Microsoft pq eu N faço ideia da onde começar","datetime":"09/04/2019 11:35"},{"user":"Raulino Neto","content":"Auxílio psicólogo se estou da A.P.D.A. já se sabe que quero. Edit: Eu achei essa vaga no LinkedIn, mas não salvei. Edit2: Lembro que era uma vaga pra PHP Fullstack, mas como não era na minha cidade eu não me candidatei. Edit3: segue o link que o Camarada achou https://br.linkedin.com/…/desenvolvedor-typescript-at-atlas… era para typescript.","datetime":"09/04/2019 16:57"},{"user":"Afrânio Alves","content":"cade o erro import emoji print(emoji.emojize(\"Legal:songlasses:\",use_aliases=True)","datetime":"09/04/2019 07:09"},{"user":"Guilherme Monteiro de Oliveira","content":"Eae galera! Node.js Estou tentando fazer um Select com join entre duas tabelas.... Exemplo: module.exports = function (sequelize, DataTypes) {   const user = sequelize.define('user', {     id: {       type: DataTypes.INTEGER(6),       allowNull: false,       primaryKey: true,       autoIncrement: true     },     nome: {       type: DataTypes.STRING,       allowNull: false     }   }, {       tableName: 'user',       timeStamps: false     });;   }   return used_features; } --------------------------------------------------------------- module.exports = function (sequelize, DataTypes) {   const user_features = sequelize.define('user_features', {     id: {       type: DataTypes.INTEGER(6),       allowNull: false,       primaryKey: true,       autoIncrement: true     },     feature {       type: DataTypes.VARCHAR(50),       allowNull: false     },      user_id {       type: DataTypes.INTEGER(6),       allowNull: false     }   }, {       tableName: 'user_features',       timeStamps: false     });   user_features.associate = (models) => {     user_features.belongsTo(models.user, {       foreignKey: 'user_id',       onDelete: \"cascade\",       onUpdate: \"RESTRICT\",     });   }   return used_features; } ------------------------------------------------------- Query: (req, res, next) => model(sequelize, DataTypes) .findByPk(req.params.id,     {         attributes: [id'],         include: [{             model: user_features         }]     })     .then((result) => {         res.send(result);     })     .catch(error => console.log('repository getById error: ' + error)); ------------------------------------------------------------ E quanto executo esta query ele me retorna 1 erro: TypeError: include.model.getTableName is not a function Como poderia resolver isso? Ver mais","datetime":"09/04/2019 18:05"},{"user":"Caio Pinho","content":"Alguém pode me indicar boas bibliotecas para trabalhar com HTTP no Java  :FAlguém pode me indicar boas bibliotecas para trabalhar com HTTP no Java  :F","datetime":"10/04/2019 13:30"},{"user":"Danilo Valeite","content":"Galera estou com uma campanha para financiar esse game, é um action RPG inpirado em \"castlevania\" e \"dark souls\"  vou deixar o link com onde tem o video do game e muito mais. link:","datetime":"09/04/2019 19:33"},{"user":"Gabriel Dutra","content":"Boa noite, pessoal. Fiz um script que busca por zabbix servers no shodan, no ultimo teste que eu fiz ele retornou muitos servidores expostos para a internet com usuario e senha default. Alem de ter encontrado alguns servidores a versoes extremamente antigas. Alem disso, o script tambem possui multiprocessamento, visando diminuir o tempo de execucao.","datetime":"08/04/2019 23:18"},{"user":"Gabrielle Lima Pereira","content":"[DÚVIDA] [GATO SÉRIO] [JS] porque 7/0 dá infinito?","datetime":"10/04/2019 18:30"},{"user":"Lucas Trindade","content":"Tem como trabalhar como programador sem fazer faculdade?","datetime":"10/04/2019 13:40"},{"user":"Jïmmÿ Ginga","content":"[HELP] Olá pessal... Para IoT qual é a linguagem mais viável e seus frameworks?","datetime":"10/04/2019 15:58"},{"user":"Jhonny Freitas Dutra","content":"Boa tarde pessoal! Eu dou aulas particulares incluindo programacao. Alguns alunos apareceram com a demanda de automatizar a extracao de informacoes de sistemas SAP e TOTVS, ou ate sistemas antigos, e gerar relatorios no excel ou   criar uma dashboard em um site. Voces conhecem alguma empresa que faz isso? Ou algo sobre que EU possa me informar mais? Alguem ja prestou servico parecido?... Outra pergunta: criar uma empresa pra prestar esse servico parece algo bacana? Seria uma boa oportunidade de negocio? Ver mais","datetime":"09/04/2019 18:15"},{"user":"Wanderson Santiago","content":"Pra quem tiver interesse em testar o novo Edge-Chromium: ","datetime":"08/04/2019 20:03"},{"user":"Andre Baltieri","content":"Galera, temos falado muito de PWAs, mas e se Apple não adotar as PWAs? E se elas realmente ficarem de fora do iOS? Será que sobreviveremos? Comentei sobre isto neste vídeo: https://www.youtube.com/watch?v=CYL4PMrIAuI","datetime":"08/04/2019 18:46"},{"user":"Misael Soler","content":"[OFF]  Só eu!?","datetime":"10/04/2019 10:27"},{"user":"Sarah Barros","content":"Alguém sabe se existe uma API para cálculo de fretes usando as novas tabelas da ANTT?Alguém sabe se existe uma API para cálculo de fretes usando as novas tabelas da ANTT?","datetime":"09/04/2019 12:08"},{"user":"Fillipe Augusto","content":"Pessoal, como eu passo dados de uma pagina pra outra no react-native? preciso passar variáveis que são alteradas numa pagina para outra, eu sei fazer no android studio mas não no react-native. AJUDA AI PLS.","datetime":"10/04/2019 10:13"},{"user":"Eduardo Schneider","content":"Genteeeeeee me deem uma luz! Eu to fazendo um projeto pra faculdade, e nele envolve fazer um mapa onde vai mostrar informações pra cada estado. Alguma ideia de como deixar cada pedaço da imagem com tratamento de click diferente? Ou alguma outra forma de fazer isso? qualquer sugestão é bem vinda auhauhau (projetinho web)","datetime":"04/04/2019 15:00"},{"user":"Simão Brandão","content":"Qual é o modo correto de programar em 3 camadas(DAL, BLL, UI) para aplicações desktop? Faço essa pergunta porque na internet existe muitos exemplos de programação em 3 camadas uns diferentes dos outros. Qual é a forma correta?","datetime":"09/04/2019 03:58"},{"user":"Gabriel Arruda","content":"OFF: entre o windows 7 e o 10 considerando um PC com i3-2120, placa mãe Gigabyte H61 e placa de vídeo Intel(R) HD Graphics, qual é o melhor desses os pra jogos? Edit 1: tem SSD","datetime":"09/04/2019 20:02"},{"user":"Osmar Andrade","content":"Boa noite.  Alguém pode me ajudar? Já tentei várias coisas mas msm assim não vai... Apaga partição, fazer nova, estender... Sla, não sei mais o que fazer.","datetime":"05/04/2019 20:34"},{"user":"Mario Elvira","content":"[Python] Alguém ajuda, estou ficando louco ;-; Não sei o que fazer, já pesquisei sobre mas nada resolveu isso, soube que é um problema comum de sintaxe","datetime":"10/04/2019 17:55"},{"user":"Thiago Gomes","content":"Boa tarde galera! Gostaria de saber quais programas para Algoritimo, modelagem de dados e HTML para Mac, vocês me aconselham?! Desde já, obrigado.","datetime":"10/04/2019 16:49"},{"user":"Philipe Edson","content":"Alguém sabe como restaurar um backup feito pelo Filezilla?Alguém sabe como restaurar um backup feito pelo Filezilla?","datetime":"10/04/2019 10:15"},{"user":"Lucas Menezes","content":"Achei interessante: A grande maioria dos desenvolvedores prefere falar ao vivo em pessoa do que através de chats online. Tudo isso apesar do estereótipo de introversão.","datetime":"10/04/2019 14:24"},{"user":"Elsio Antunes","content":"Quem man(di)a de chromebooks meus bacanos? (acabo de descobrir que meu  xota não tá funcionando)","datetime":"05/04/2019 14:16"},{"user":"Kaio Cézar Oliveira","content":"Pessoal que trabalha como PJ,  qual banco vcs tem \"conta PJ\" e conhecem alguma que é fácil pra abrir conta, tipo pra ontem? Valeu","datetime":"10/04/2019 06:31"},{"user":"Wesley Câmara","content":"Com quanto tempo de estudo vcs entraram na área? seja JR ou estágioCom quanto tempo de estudo vcs entraram na área? seja JR ou estágio","datetime":"10/04/2019 13:44"},{"user":"Stallone De Jiloy","content":"Alguém ali pra me ajudar a fazer  Um algoritmo que lê um número inteiro e escreve no ecrã se é para ou ímpar  Nas estrutura condicional composta  Por favor dão uma força","datetime":"09/04/2019 16:29"},{"user":"Adrien","content":"Pra quem não sabe direito qual area seguir, ele fala só por cima, mas da pra ter uma ideia","datetime":"10/04/2019 17:57"},{"user":"Christian Veiga","content":"👔 Vaga: Desenvolvedor Full Stack 💼 Senioridade: Senior 🏣 Empresa: CEOS Energia 📍 Localização: Belo Horizonte 👉 Candidatar: http://bit.ly/ceos_face... 🦊 Quer receber outras vagas de TI? Envie seu currículo para: fellipe.couto@vulpi.com.br Ver mais","datetime":"10/04/2019 11:46"},{"user":"Rafael Leal","content":"[Udemy e RL System] Curso de Laravel grátis  Com certificado, exemplo na foto....... Formato de videoaulas...Disponibilizado na Udemy e RL System. Acesso gratis pro pessoal aqui do grupo. Apenas pro pessoal do Grupo!!!! 1 - Enviar e-mail solicitando acesso para contato@rlsystem.com.br 2- Escrever UP aqui no post. Se não der UP nao temos como verificar se é membro do grupo. O acesso gratuito é exclusivo pro pessoal daqui. 3 - Tem que enviar o e-mail conforme item 1 pra encaminhamos seu acesso ao curso..... Pessoal é apenas 100 vagas novas... Grande Abraço Ver mais","datetime":"05/04/2019 14:41"},{"user":"Bruno Mayol","content":"Boa noite pessoal,  Minha empresa está contratando desenvolvedores juniores/pleno de Javascript/Node com salário a combinar. (Pleno acima de 5k, não é empresa miserável). A empresa fica em São Paulo (cidade), então seria interessante morar perto. Quem tiver interessado coloca ai nos comentários que eu chamo pra entrevista. Temos uma prova técnica de algoritmos de 10 questões que deve ser feita antes da entrevista. Valeu","datetime":"08/04/2019 22:18"},{"user":"Enzo Ferrari","content":"Estou tendo problemas com o live share do visual studio 2019, inicio a sessão, alguém entra mas ninguém visualiza o cursor de ninguém nem o convidado pode editar (mesmo não estando em somente leitura). É alguma configuração que tenho que mudar?","datetime":"08/04/2019 20:09"},{"user":"Khris Lessa","content":"Olá, alguém pode me ajudar, por favor, tenho um trabalho pra fazer e o computador qdo fui ligar fica com o ponteiro do mouse atualizando e não aceita nenhum comando. Não conheço ninguém de confiança pra formatar e não posso perder os arquivos da máquina. Por favor, alguém pra dar help?","datetime":"10/04/2019 20:31"},{"user":"Michel Damasceno","content":"Vaga programador PHP/Laravel (júnior/pleno) REMOTO Conhecimentos obrigatórios: Conhecimentos em banco de dados, PHP, JavaScript/JQuery, HTML, CSS, Git,conhecimento em ecommerce, Laravel > 4.2 Enviar CV com pretensão salarial : michel.visolutions@gmail.com","datetime":"05/04/2019 16:24"},{"user":"João Amado","content":"Alguém indica um script/biblioteca js para fazer esse tipo de compartilhamento nas redes sociais? Estou usando html/css/javascript. Cada rede social tem sua particularidade, eu queria algo em que eu pasasse uma string e a url da pagina atual e gerasse os botões para várias redes sociais. No wordpress eu utilizava o plugin social share mas estou no html/css/javascript e sem a possibilidade de utiliza-lo.","datetime":"08/04/2019 22:18"},{"user":"Fernando Silva","content":"Link Direto(google drive) Liberado no Primeiro comentário, quando atingir 40 comentários. 🐧 Instagram segue lá, muito mais conteúdo, diariamente ⤵️ https://www.instagram.com/curso.linux/?hl=pt-br","datetime":"08/04/2019 15:53"},{"user":"William Schons","content":"","datetime":"10/04/2019 19:53"},{"user":"Luís Bulek","content":"Sobre a tal \"foto\" do Buraco Negro, que na verdade foi uma imagem do Horizonte de Eventos de um buraco negro, captados por uma rede de telescópios espalhados pelo globo terrestre (sim, a terra é redonda), levaram dois anos para processarem os dados e transformarem numa imagem. A imagem em si não importa, é mais para a mídia divulgar, o que importa são os 5 Peta bytes de dados capturados por todos os telescópios distribuídos pelo globo terrestre. Como são regiões remotas e não são servidas por redes de fibras óticas, esses dados tiveram que ser armazenados em Discos Rígidos (HD), sim, em simples HDs de computador, e levados para um centro para o processamento. O tamanho destes HDs empilhados, chega a 6 m³, sim, isso mesmo, 6 metros cúbicos de HDs se fossem empilhados.","datetime":"10/04/2019 17:57"},{"user":"Hugo Havoc","content":"Boa tarde galera, tava revisando algumas partes introdutória de um curso sobre média query mesmo conhecendo um pouco sobre esse recurso e utilizando bastante no dia-a-dia... Porém não conhecia o uso do orientation landscape, dae veio algumas dúvidas se eu utilizar este parâmetro no média query ele funciona pra qualquer dispositivo que esteja deitado ex: tanto pra tablet quanto pra celular ou preciso definir qual largura do dispositivo junto com o parâmetro?  E esse recurso é utilizado? Pois acredito que não o conhecia e  atualmente os celulares padrões quando estão deitados se encaixam praticamente no mesmo width de tablets mais utilizados atualmente em pé. (mais ou menos 800px). Alguém pode me esclarecer melhor o uso do landscape? desde já agradeço.","datetime":"08/04/2019 20:22"},{"user":"Sampaio Leal","content":"Dia em que o simulado de linguagens me conquistou <3 By: Professor Fernando Lira <3 😍","datetime":"08/04/2019 18:45"},{"user":"Rodrigo Martincic","content":"(fun).. Como você se sente quando os chefes/cliente aprovam o projeto para remover o Windows de 500 pcs de um cliente, aconteceu comigo a pouco tempo atras aaa satisfação ...https://www.facebook.com/nixcraft/videos/647954732320962/","datetime":"05/04/2019 18:02"},{"user":"Ramon Souza","content":"Estou fazendo uma pesquisa para um trabalho da faculdade, e preciso da sua ajuda para responder esse questionário, são apenas 13 perguntas, será rapidinho, segue o link 👉🏽 https://forms.gle/8tNmnRukzHCn825BA Muito obrigado pela ajuda ! 🤙🏾","datetime":"10/04/2019 19:25"},{"user":"Johnny Lorran","content":"Boa tarde galera, atualmente estou cursando Técnico em informática, amanhã terei uma entrevista de estágio e precisava estudar um pouco de java /php e mysql, como não tenho PHP no curso e Java para web, estou aprendendo ainda... Alguém poderia me indicar o que estudar pra fazer uma prova básica? Desde já grato !","datetime":"08/04/2019 17:39"},{"user":"Bruno Santos","content":"[off] Na Índia aparentemente além de engenharia da computação eles tem também a medicina da computação.","datetime":"10/04/2019 15:46"},{"user":"Donquixote Rosinante","content":"Para se tornar um Full Stack, o que é melhor no início, começar com frontend ou com o backend?","datetime":"08/04/2019 18:41"},{"user":"Victor Nascimento","content":"Fiz um curso  para iniciantes em JAVA e depois um em JAVA  EE WEB ..muito bom agr vou começar um de desenvolvedor de aplicativo  quem quiser tbm so fala","datetime":"05/04/2019 13:01"},{"user":"Leonardo Gomide","content":"[help] Alguem que use o VS no mac poderia me indicar a configuração minima necessária? Estava olhando um core 2 duo, com 8gb Ram, será que roda?","datetime":"08/04/2019 18:11"},{"user":"Wagner Braga","content":"SOLUCIONADO - [:SERIOS-CAT] Uso uma hospedagem aws e não cossigo acessar o BD. Já tentei:  mysqld_safe --skip-grant-tables Mas retorna:... mysqld_safe Fatal error: Can't remove the pid file: /var/run/mysqld/mysqld.pid. Alguém já conseguiu solucionar algo parecido? Ver mais","datetime":"09/04/2019 10:15"},{"user":"João Victor","content":"Alguém que tem site no dot.tk ou freenom tá com problema com eles? Tenho dois domínios lá que uso pra fazer redirecionamento e ao acessar o user acaba caindo em páginas de login. Acho que invadiram o DNS deles.","datetime":"05/04/2019 19:47"},{"user":"Gabriel Ferreira","content":"Você gosta de podcast? 🎧 Então deixa eu te apresentar 11 podcasts de tecnologia, programação e carreira que você TEM QUE OUVIR: ","datetime":"10/04/2019 14:29"},{"user":"Sidiney Cassiano","content":"[Paas, Saas, Iaas] Olá pessoal, tudo bem? Eu decidir dar uma estuda nesses termos acima e gostaria de saber de vocês se eu consegui entender o conceito de cada um:... Paas - É um serviço que nos fornece uma plataforma onde podemos hospedar, gerenciar e monitorar o nosso App. Um exemplo disso seria o Heroku. Saas - Basicamente um software web. Por exemplo, o Gmail, Facebook, Google Docs, um sistema de gerenciamento de estoque online e etc... Iaas - Nos é fornecida uma infraestrutura onde criamos o ambiente de acordo com as nossas necessidades. Basicamente temos uma VPS que deixamos a nossa maneira. Exemplos: Digital Ocean, EC2 da AWS... Ver mais","datetime":"05/04/2019 18:59"},{"user":"Lewis Saiete","content":"E possivel desenvolver um website so com Javascript?","datetime":"10/04/2019 03:06"},{"user":"Viviane Matias","content":"Olá, galera!  Estou divulgando o vídeo novo do canal Projeto Potigol, uma linguagem de programação desenvolvida pelo nosso professor Leonardo Lucena, com intuito de ensinar programação a todos que sentirem curiosidade, de forma simples e prática. Ficaria muito grata se puderem dar uma conferida. Aproveitem e nos sigam!  (Peço desculpas desde já se não puder compartilhar/divulgar esse conteúdo). Desde já, tenham um OTIMO DIA!","datetime":"10/04/2019 12:53"},{"user":"Pedro Henrique da Silva","content":"Gente, eu queria saber como faço pra usar um mp3 do meu pc em um player online. Tipo, eu já tenho o player, mas não sei \"botar\" o arquivo de aúdio nele. Alguém me dá uma ajuda? (Sou iniciante ainda, considerem isso)","datetime":"10/04/2019 18:15"},{"user":"Gabriel Krahn","content":"Pessoal, Como fazer o tal do \"networking\" pessoalmente, em eventos e coisas do tipo? Ultimamente tenho frequentado workshops, palestras e eventos similares e sempre ouço falar no tal do networking mas nao tenho ideia de como fazer isso nesses eventos, ainda mais sem conhecer ninguém. Qual é a manha pra sair desses lugares com alguns contatos? Inclusive estou esperando a abertura de um workshop de desafios na gestão de TI no momento e mais uma vez ouvi que \"no coffee esta rola...ndo um networking\". Valeu! Ver mais","datetime":"09/04/2019 16:46"},{"user":"Metamorphic Jarvis","content":"[RESOLVIDO PHP] Oi, criei três paginas PHP (session.php,redirect.php e cookies.php), e o usuario loga no cookies, passa no redirect e exibe boas vindas no session, mas as variaveis $_COOKIES e $_SESSION nao têm os valores exibidos. É como de tivessem os seu valores apagados. O meu objectivo é criar um cookie com os dados e depois obter o seu valor na pagina session.... Aqui esta o codigo: cookie - https://pastebin.com/Jcj0u66N redirect - https://pastebin.com/vvK0Ma6x session - https://pastebin.com/93DkMMcK RESUMO: cookie envia os dados do formulario para o redirect criar o cookie e depois vai para session que deve(ria) ler o cookie e exibir boas vindas. Ja testei por link e deu certo, mas quero testar por cookie e ja verifiquei a sintaxe e li o manual e nada. Ver mais","datetime":"09/04/2019 19:11"},{"user":"Filipe Deschamps","content":"Fala turma da APDAAAAAAAAAA!!! Vídeo novo no canal com uma técnica muito legal que mistura Async/await com Loop e Try/catch. É extremamente simples e poderoso :) PS: quem programa funcional ta proibido de ver esse vídeo kkkkkk","datetime":"08/04/2019 12:38"},{"user":"Gabriel Ferreira","content":"Qual é a melhor linguagem de programação? Descubra no episódio do Hipsters Ponto Tube de hoje com o Paulo e a Roberta :) Assista agora: https://www.youtube.com/watch?v=Uh-GNH-t89w","datetime":"10/04/2019 17:00"},{"user":"Vinícius Leal Trindade","content":"Pessoal, tenho um projeto no github de uma pokedex feito totalmente em Vue com dados de uma api rest bem legal, chamada pokeapi. O repositório tava parado há um tempo e to dando uma reativada nele, quem quiser contribuir to aceitando pull requests ","datetime":"09/04/2019 23:11"},{"user":"Nilton José Rizzo","content":"","datetime":"10/04/2019 17:47"},{"user":"Luiz Fernando da Silva","content":"Bom dia, meus confederados Trabalhando com IoT, eu sempre me deparo com um momento em que eu tenho que explicar pro pessoal que programa firmware (que normalmente é de engenharia, não de computação) porquê o protocolo HTTP não deve ser usado para uma troca de mensagens em que tanto servidor quanto cliente podem iniciar a conversa. Normalmente, os argumentos mais frequentes são: 1. Requisições periódicas HTTP... 2. A conexão TCP é persistente e bidirecional, é só você configurar o timeout da conexão no servidor. No entanto, nós que programamos pra web sabemos que as duas soluções não são viáveis. A questão 1 é mole de justificar porque gera tráfego em excesso e tal. Já a 2 parece má vontade minha. No entanto, eu argumento que nesse caso, estaríamos usando uma chave de boca para fazer a função de um martelo, porque o protocolo HTTP não foi construído para esse tipo de conexão persistente (e eu estou falando de persistente mesmo, não da possibilidade do HTTP 1.1 de fazer várias requisições na mesma conexão TCP antes de fechá-la). Bom, e dai? E daí que eu gostaria de uma recomendação de material para me embasar melhor nesse embate, porque tudo o que eu acho diz apenas que \"ah, é uma conexão cliente-servidor, segundo o RFC\", que pra mim é autoexplicativo, mas não tá sendo o bastante. O que me indicam? Como convencer de que, por mais que seja \"a mesma coisa\", HTTP não é uma solução adequada? EDIT: Eu também prefiro MQTT!! Ver mais","datetime":"10/04/2019 08:37"},{"user":"Henrique Brito","content":"Mudei de cidade para estudar ciência da computação e o gabinete era muito grande para mala kkkk Então Esse é o meu novo design de setup kkkk","datetime":"04/04/2019 15:11"},{"user":"Rafael Câmara","content":"","datetime":"10/04/2019 16:54"},{"user":"Andre Luiz","content":"Desabafo: eu to a 3 dias tentando resolver um problema com o electron-builder que eu n fazia ideia do que era, quando fui descobrir era a merda do nome de usuário do windows que estava com caracteres especiais, nunca mais eu uso português pra nada relacionado a DEV 🤣🤣😂😂,  Bom dia !","datetime":"10/04/2019 07:39"},{"user":"Ernani Nascimento","content":"Fala galera! Alguém aí já deu atenção àquelas sugestões de amizade que aparecem aqui no FB? Várias das sugestões vem com \"sugerido por... fulano\". Eu tenho uma outra conta que uso apenas para uns freelances. Chegam várias sugestões que hipoteticamente foi essa minha conta quem sugeriu. Mas aí vem a questão, só eu uso a conta, e eu não indiquei amigos. Então...","datetime":"09/04/2019 22:31"},{"user":"Severino Bonifácio","content":"[OFF] Galera, eu tenho tentado muito, mas parece que não linux não vale a pena. Desinstalei windows da máquina e instalei somente Ubuntu (com o propósito de aprender linux), o sistema simplesmente vem me deixando na mão. Por exemplo: hoje eu instalei o eclipse, tudo bonitinho, de manhã, inclusive criei e compilei um programa, agora de noite fui procurar o programa e simplesmente desapareceu, como assim?? E não foi a primeira vez que acontceu, já sumiram outros também, agora estou reinstalando aqui e espero que não se repita. Por favor, defensores e experts em linux, me ajudem... o sistema é cheio de falha mesmo ou eu que não sei operá-lo?","datetime":"07/04/2019 23:50"},{"user":"Eduardo Assumpção","content":"Pessoal, Pensando numa carreira em programação, qual curso faria mais sentido: - Engenharia de Produção... - Engenharia da Computação Visto que eu faria cursos extras voltados para programação em si, e não uma graduação específica. Ver mais","datetime":"07/04/2019 03:15"},{"user":"Makinson Agostini","content":"alguém mais já testando o novo Edge baseado no Chromium?","datetime":"09/04/2019 23:51"},{"user":"Henrique Santos Lima","content":"Vocês já obtiveram algum resultado em desempenho ao utilizar boost em C++(i.e: cout.tie(0) ou um conjunto #define boost ios_base:: sync_with_stdio(0);cin.tie(0); cout.tie(0))? Se sim, quais foram os resultados?","datetime":"10/04/2019 15:04"},{"user":"Paulo Brito","content":"Eles querem invadir a sua praia #ameaças #bitcoin #coinhive #criptomoedas #cryptominer #monero #slider","datetime":"10/04/2019 14:39"},{"user":"Allan Alves","content":"","datetime":"08/04/2019 20:43"},{"user":"Daniel Lopes","content":"Olá, tudo bem?Conheçam o nosso portal de cursos de Programação.... https://jacode.com.br/  Ver mais","datetime":"10/04/2019 12:56"},{"user":"Jackson Morais","content":"","datetime":"09/04/2019 14:46"},{"user":"Paulo Matos","content":"Queria pedir sugestão de placa de vídeo de ate 300 reais, que consiga rodar jogos, não precisa ser no ultra, só preciso garanti os FPS, que seja melhor q a HD Graphics 4000 kkkk Meu pc é i7 3GHz, 8 de ram Comprei o jogo RiME e nem no mínimo esta dando pra jogar ele =/ Obs.: GT 730 vale apena?","datetime":"09/04/2019 14:07"},{"user":"Bruno Henrique","content":"Galera, no Angular 7, preciso retornar diretamente o conteúdo de um componente, alguém sabe como? EX: Eu tenho => <table>     <meu-componente>...         <tr>            Conteúdo         </tr>     </meu-componente> </table> quero que no html apareça direto o  => <table>     <tr>       Conteúdo     </tr> </table> Ver mais","datetime":"10/04/2019 12:05"},{"user":"Osvaldo Relder","content":"É imensurável a quantidades de sites novos que são colocados na internet todos os dias, mas será que todos eles são sites seguros? Se você quer vender na internet, ter uma loja online ou mesmo um e-commerce, você precisa dedicar alguns minutinhos do seu dia para ler esse artigo que preparamos a você. Continue lendo: http://bit.ly/importanciassl... #criaçãodesitesemmanaus #sitemanaus #desenvolvimentodesites #manaus #amazonas #criaçãodesites #marketingdigitalmanaus #webdesignmanaus #marketingManaus #marketing #empreendedorismomanaus #midiassociciasmanaus #norte #nordeste #sudeste #sul #brasil #portugal #eua #saopaulo #seligamanaus #rdstation #seobrasil Ver mais","datetime":"10/04/2019 13:32"},{"user":"Joni Sar","content":"Build a Super-Modular Todo App with React and Bit Components - very awesome! 🙌","datetime":"10/04/2019 13:06"},{"user":"Fergunson Souza","content":"Boa noite para todos nascidos no mês de Pode","datetime":"09/04/2019 18:41"},{"user":"Felipe Barros Macêdo","content":"Quero desenvolver para web com Java. O que acham da stack desse curso? Spring Frameworks iReport Hibernate JavaServer Faces... PrimeFaces Mobile JPA - Java Persistence API Hibernate Envers Flyway JavaEE SQL e PostgreSQL AJAX. Obs.: não precisa entrar no mérito de outra linguagem ser melhor que Java, só quero saber mesmo se o conteúdo acima é o que as empresas usam Ver mais","datetime":"10/04/2019 07:31"},{"user":"Kelvin Domingos","content":"Hey pessoal estou precisando de uma ideia para um projeto que tem haver com saúde ou educação para um soft ou web site","datetime":"09/04/2019 19:45"},{"user":"Uender Araujo","content":"Boa noite, alguém sabe de um site ou extensão boa que funcione para fazer um print [ imagem capturada ] do site todo para ser salvo nos formatos PC, IPHONE, TABLET ? Preciso fazer pra ficar como esta foto.","datetime":"09/04/2019 19:29"},{"user":"Weverson Fernandes","content":"Estou testando um stresser contra meu próprio servidor (fins didáticos) e quando o php cria uns 60 processos o site para de responder.  Como posso aumentar a capacidade dele? No caso, a máquina tem beeeem mais processamento/memória, mas creio que há um limite sobre a quantidade que o php possa usar e quando atingi, o site para. Obs: Estive lendo sobre a variável \"memory_limit\" e ela está relacionada ao uso de memória de apenas 1 script, e não do php de modo geral... Então creio que não seja ela.","datetime":"07/04/2019 21:18"},{"user":"Rodrigo Martincic","content":"Eu sempre achei que meus estagiários tinham poderes psíquicos para provar vou ter de jogar alguns na bacia de Vitória e ver se os golfinhos vão vir salvá-los.","datetime":"06/04/2019 09:50"},{"user":"Flory Mignon","content":"A primeira palavra que você rodou numa programa era também \"hello world\"? Kkk","datetime":"06/04/2019 16:26"},{"user":"Andrew Manuel Andrew","content":"[Angola Agradece] Angola é um país lindo e belo! mas nós nos adaptamos e damos o nosso máximo para aprender a programar, lendo muitas apostilas, mesmo com a escassez de Internet, e isso as vezes nos deixa meio de cabeça para baixo! as vezes queremos buscar alguma informação vendo um vídeo aula para ver a ideia que o outro fez, buscamos, do Gustavo Guanabara, Daniel Vieira, no site, da Dark, entre outros. Portanto quero agradecer a estes que de forma direita ou indireta tem aj...udado muito para o crescimento dos outros na área de tecnologia, e que realmente nunca pararam de dar seu melhores para ajudar os outros na internet e não somente Angola e sim o mundo! Apesar de estarem a zoar o pessoal pelas perguntas que as se parecem ser bizarro, mas tem ajudado muito! vcs tem sido paciente e não parem continuem assim! Meus votos de agradecimento a todos! Ver mais","datetime":"15/03/2019 03:21"},{"user":"Eduardo Schmidt","content":"Galera, tem alguém aqui que entende de Visual Studio especificamente de WPF C# ? eu sou leigo no assunto, mas com muita insistência criei meu primeiro WPF, launcher para um jogo... mas preciso por os arquivos (na imagem anexada) dentro de um diretório para não ficar tão bagunçado.. alguém pode me ajudar?   estou disposto a pagar para quem quiser organizar para mim. (nao posso pagar muito)... A pasta \"resources\" é aonde queria que todos esses arquivos fora o \"sample1\" fosse trocado o diretório. Ver mais","datetime":"10/04/2019 03:16"},{"user":"Sandra Lazarini","content":"🕹😍","datetime":"10/04/2019 10:46"},{"user":"Anderson Oliveira de Paula","content":"🤔Scrum no Mundo Real (no dia a dia é diferente!)  Escute esta Entrevista Podcast com André Barbosa, é só colocar seu fone de ouvido e deixa rolar! \"Aprender o Scrum é muito fácil; tem muito material gratuito na Internet, porém a realidade é que no dia a dia (no Mundo Real) as coisas são bem diferentes.  É preciso tomar muito cuidado com lado pessoal\", disse... A entrevista tratou: - A importância;  - Os desafios;  - Cuidados a serem tomados;  - Boas práticas? - Quais são os erros comuns na utilização do Scrum e como evitá-los; - Os papéis no Scrum: Scrum Master, Dono do Produto - Sobre o Coach Agil - O ossos do ofício no dia a dia do Scrum (no Mundo Real não é tão fácil) Escute por aqui 👇 http://bit.ly/entrevista-podcast-scrum-no-mundo-real Ver mais","datetime":"10/04/2019 10:41"},{"user":"Андрей Смирнов","content":"Ué kkkk","datetime":"06/04/2019 05:00"},{"user":"Leonardo Lima","content":"","datetime":"08/04/2019 12:35"},{"user":"Lucca Faria Ferri","content":"Estou morando no reino unido, e fui mandar um link da udemy pra um colega meu que quer comecar na area de prog e nao faz ideia por onde comecar, eh impressao minha ou os precos aqui sao muito mais caros (pelos mesmos cursos)? https://www.udemy.com/csharp-tutorial-for-beginners/ ...(desculpa pela falta de acentuacao) Ver mais","datetime":"07/04/2019 14:34"},{"user":"Wiliam Joaquim","content":"[OFF]","datetime":"04/04/2019 19:26"},{"user":"Milson Pazienza","content":"Olá galera qual o melhor jeito ou App pra remover malwares no Android, meu celular tah exibindo um monte de anúncios chatos.","datetime":"09/04/2019 16:49"},{"user":"Marcel Bueno de Paula","content":"[PHP] Fala povo, vocês conhecem algum codigo pronto que faça o calculo de distancia entre dois endereços? por exemplo, no form eu coloco \"rua 1 , 1555 , São Paulo\" e \"rua 2, 1444 , São Paulo\". E dando \"submit\" retorne com a distancia em KM entre as duas ruas.... Se conhecerem, podem me passar? Estou vendo algumas coisas no google maps mas é um pouco confuso a questão de cobrança. Ver mais","datetime":"08/04/2019 16:16"},{"user":"Marcelo Rocha","content":"Resolvido com PrintThis, obrigado a quem se importou com o problema! Aí brothers and sisters que usam Jquery DataTable: Estou procurando e reprocurando mas não acho, preciso que ao imprimir ou salvar como PDF seja mantido o CSS da página.... No entando, sai tudo sem respeitar o css, apenas no modo texto. Uma das colunas de resultado é uma div que pega muito css, eu gostaria que a impressão fosse fiel a ela. Ver mais","datetime":"08/04/2019 07:55"},{"user":"Lewis Saiete","content":"E ai galera, blz? To com uma duvida. Quando diz-se que um programador é Júnior ou senior ? e quando deixa de ser junior e passa a ser senior? É necessário que ele participe de projectos para ser considerado senior ou só programando mesmo??","datetime":"09/04/2019 03:35"},{"user":"Iury Pinheiro","content":"Alguém aqui conhece a plataforma Shopify? Tenho uma loja virtual e tá com um problema na variant, quando o cliente coloca a cor do produto, a foto não muda. Alguém consegue resolver?","datetime":"10/04/2019 04:12"},{"user":"Amarildo Alfredo II","content":"Consider o registo de um funcionário de uma empresa elabore um programa que mostre o nome o gero e a função do funcionário. string Funcionrio; Console.WriteLine(\"Nome : Amarildo Alfredo\"); Console.WriteLine(\"Genero : Maculino\"); Console.WriteLine(\"Função : Contablista\");... Funcionrio = Console.ReadLine(); Console.ReadKey(); Ajudem pessoal será que está serto Ver mais","datetime":"10/04/2019 02:07"},{"user":"Leonard Henrique","content":"Alguém poderia me ajudar, estou tentand fazer a instalação do chatterbot e ta dando esse erro...","datetime":"10/04/2019 01:13"},{"user":"Carlos Henrique Costa","content":"Gente eu criei um site adulto a um tempo atrás pra um cliente é legal colocar isso no portfólio? Ou pode ser mal visto por alguma empresa ?","datetime":"08/04/2019 15:22"},{"user":"Thiago Taveiros","content":"","datetime":"10/04/2019 00:22"},{"user":"Enrico Robazza","content":"[WORDPRESS] Galera, qual a melhor forma de incluir uma funcionalidade em meu site wordpress?  - Editando o código do tema - Inserindo diretamente nas páginas (com inserções de código back end e javascript)... - Procurando um plugin pronto (e talvez editando ele, não sei como isso é possível) A funcionalidade que quero incluir é uma tabela com botões que causem pop-ups, etc. Ver mais","datetime":"08/04/2019 10:54"},{"user":"Domitila Crispim","content":"Gente alguem sabe um simulador de SQL oracle online? edit: achei ! https://livesql.oracle.com/apex/f…:::","datetime":"08/04/2019 19:28"},{"user":"Leandro Santiago Rosa","content":"Boa noite Galera!  Alguém ai já usou alguma API para fazer ligações telefônicas? Vou explicar a necessidade. Estou criando um sistema que deverá monitorar algumas informações. Caso essas informações estejam fora do esperado, eu gostaria de fazer uma ligação para 1 ou mais dispositivos com uma mensagem gravada, sem que eu tenha que falar com a pessoa. ... E o mais importante, se houver, claro, que seja gratuita. Ver mais","datetime":"09/04/2019 22:42"},{"user":"Rennan Barros","content":"Sobre o script para checar novos emails, a versão 0.1 estava retornando emails da Inbox da caixa Principal, Social e Promoções. Atualizei para a versão 0.2 para pegar somente textos da caixa principal da Inbox, porém estava tendo um problema em retornar todos os emails e acaba escapando alguns. Atualizei para a versão 0.3 e agora o script retorna todos os emails da sua caixa principal de emails.","datetime":"09/04/2019 22:02"},{"user":"Robson Cristian Tomaz Pereira","content":"\"Posso colocar cursos da Udemy no currículo?\" \"O mercado gosta de cursos da Udemy?\" Já vi essa pergunta algumas vezes aqui no A.P.D.A e em outros grupos.... A minha resposta vale para o caso dessa e muitas outras plataformas. Se a empresa é boa, ela sabe que nessas plataformas você consegue o certificado de muitos cursos só marcando as aulas como concluídas. // O RH pode não saber, mas o líder técnico, coordenador, gerente... alguém da área tá ligado ;) Então, a empresa não dá muita bola para um currículo cheio de cursos dessas plataformas. Simples assim. Porém, existe um jeito muito melhor de \"mostrar serviço\". Essa é até uma dica que dou para quem busca o primeiro emprego. Faça um projeto f*da com o que aprendeu e publique no Github. Isso vai servir muito mais para comprovar os conhecimentos do que uma centena de certificados de cursinhos. Espero ter ajudado! Ver mais","datetime":"07/04/2019 22:20"},{"user":"Felipe Franco","content":"Saiba como o objetivo do sprint pode ajudar a equipe a entregar mais valor, aumentando a satisfação dos clientes com o produto. https://www.youtube.com/watch… Entre na Lista VIP informando apenas o seu e-mail (link na descrição do vídeo), para receber outras dicas e reflexões!!... Abraço! Ver mais","datetime":"09/04/2019 21:37"},{"user":"Felipe Avelar","content":"[Dúvida] Existe como fazer um container docker pra codar um App react-native? Se sim, existe material pra me direcionar? Já procurei um monte e não consegui achar nada :~","datetime":"09/04/2019 20:57"},{"user":"Lucas Martins","content":"Algoritmo de inserção e remoção em filas duplas alguém tem um aí de exemplo, serve qualquer linguagem","datetime":"09/04/2019 21:00"},{"user":"Lucas Souza","content":"Oi Galere, consegui fazer o flappy bird com menos de 180 linhas de código. Pra quem tem interesse m JS sem frameworks, vem dar uma olhada.","datetime":"08/04/2019 11:07"},{"user":"Rufo Paganini","content":"Alguém já usou SQLite com Ionic 4? A função openDataBase não está rodando (...)","datetime":"09/04/2019 20:28"},{"user":"William Santos Dantas","content":"Eu preciso fazer um documento de requisito de sistema. eu tenho algumas duvidas. oque colocar nos requisitos não funcionais? tenho que listar todas as telas? ( é para um sistema de gerenciamento de estoque web. é para faculdade. )","datetime":"09/04/2019 19:52"},{"user":"Luis Fernando Konopacki","content":"Alguém sabe um IDE bom para PHP e HTML? EDIT: Para linux","datetime":"06/04/2019 14:48"},{"user":"Rúben Nunes","content":"Boa noite, estou aprendendo a linguagem Python, mas eu gostaria de saber o que eu posso fazer com a mesma ou que tipos de sistemas posso criar? É possivel eu integrar essa linguagem no html?","datetime":"09/04/2019 18:28"},{"user":"Silas Fernando","content":"Jogo torneio de campeões. E o estagiário ataca mais uma vez.","datetime":"09/04/2019 19:19"},{"user":"Rogério Duarte","content":"Alguém sabe o que isso faz ou significa?","datetime":"30/12/2018 22:10"},{"user":"Guilherme Nunes","content":"[C#][HELP] To aqui estudando C# e POO, tentando instanciar um objeto (classe) por array, sendo que quero passar parametros pelo metodo construtor, mas ta dando uma complicação do cão. ENTÃO, fui ler a documentação, vi que é usado lista, to em duvida. Meu metodo construtor ta errado, ou realmente é usado list?... (No caso o metodo construtor tem o mesmo nome da classe) Ver mais","datetime":"09/04/2019 18:50"},{"user":"Pedro Torman","content":"[ASP.net] Preciso criar uma logica de uma tarefa agendada(scheduled task) para notificar os usuários em determinado horário informando suas atividades pendentes conforme uma consulta do banco, notificação por email via smtp ja funciona em outras funções vejo que é tranquilo reaproveitar, problema está na tarefa automática.. HELPPP!","datetime":"08/04/2019 16:20"},{"user":"Samuel Oliveira","content":"Estive com alguns pensamentos dentro de minha cabeça sobre algorítimos de ordenação, sim, isto me pertubou por uns bons minutos, e comecei a me perguntar, porque gastamos tanto tempo aprendendo... sobre os algorítimos ordenadores existentes, alguns criados quando nós nem ainda éramos nascidos, isto faz algum sentido? Não podemos esconder de ninguém que somos curiosos por tecnologia, e vivemos respirando, para aprender ou pelo menos conhecer tudo sobre o assunto, mas nosso cérebro tem limites, as informações são adicionadas aos poucos, e algumas vezes nos sentimos frustrados por não pode dominar tudo o que gostaríamos de dominar. Não encontrei resposta melhor do que esta,  mas se você conseguir por favor poste nos comentários para que possamos conhecer sua opinião. Resposta: Acelerar o processo de pesquisa no computador, otimizando a capacidade de acessar milhares de dados de forma eficiente, para que o desempenho da máquina não seja afetado enquanto estamos fazendo outras tarefas ao mesmo tempo em que programamos, ou ouvimos nossas músicas favoritas; Pra mim esta é a resposta, e aqui está um bom exemplo de uso do famoso método bubble sort para ordenação de um vetor de inteiros carregado por um loop for, e embaralhado para podermos aplicar a ordenação. Ver mais","datetime":"09/04/2019 19:35"},{"user":"Daniel Vilarinho","content":"Existe mais alguma ide pra c# alem de visual, ride , e o mono ?? Agradeço desde jáExiste mais alguma ide pra c# alem de visual, ride , e o mono ?? Agradeço desde já","datetime":"05/04/2019 21:29"},{"user":"Lucas Cavalcante","content":"alguém sabe uma tecnologia que é possível desenvolver para web tanto como para mobile? e que não seja Java/javascriptalguém sabe uma tecnologia que é possível desenvolver para web tanto como para mobile? e que não seja Java/javascript","datetime":"03/04/2019 19:51"},{"user":"Guilherme Cunha","content":"Seria possível emular essa tecla? (AHK por exemplo) Alguns teclados quando vc aperta FN + *Key*  conseguem alterar as cores, velocidade e tals, mas os mesmos não tem um software e a edição é feita fisicamente, queria saber se seria possível emular essa tecla, se sim, como?","datetime":"09/04/2019 12:05"},{"user":"Pedro Chess","content":"[AJUDA] Pessoal, estou com um probleminha ao usar a API FileSystem. Eu estou recebendo um código de erro 13, que significa que o caminho naum tem permissão para modificação. Estou errando em alguma coisa?","datetime":"08/04/2019 22:08"},{"user":"Lucas Pires","content":"Quais são as maiores agências de webdesign?","datetime":"07/04/2019 21:22"},{"user":"Matheus Assis","content":"","datetime":"09/04/2019 18:18"},{"user":"Pedro Lima","content":"HELP. Boa noite meus bons, estou com dúvidas em relação a e-commerce um cliente, em quanto conversávamos sobre como ele quer no site me perguntou se teria como ele próprio realizar alterações no site sem auxílio de ninguém como em plataformas semelhantes ao wix ou outras aonde ele poderia editar valores e etc. ( é meu primero projeto ) Vlw pela atenção","datetime":"06/04/2019 20:45"},{"user":"Allan Alves","content":"","datetime":"07/04/2019 15:51"},{"user":"Bieel Ribeiro","content":"Eai galera. Com qual linguagem de programacão voces iniciarem nesse meio? e porq? Com os conhecimentos que tem hoje, acha que foi uma boa escolha ou teria comecado com outra?","datetime":"09/04/2019 08:39"},{"user":"Ayrton Teshima","content":"Redes para desenvolvedores: Introdução ao HTTP e TCP/IP  Galera, essa minissérie merece compartilhamento, o que acha? Me ajudem para que chegue em mais pessoas ;) Eu sou Ayrton do canal no YouTube Programador a Bordo. Este é o primeiro vídeo da minissérie sobre o protocolo HTTP e outros protocolos que o cercam e impactam no nosso desenvolvimento: TCP, IP e DNS.Não importa se você é front, back ou devops, todos precisamos saber bem o protocolo HTTP e o funcionamento da interne...t. Nesta aula eu dou uma visão geral das diferenças entre HTTP, TCP e IP e como eles trabalham juntos.Link do vídeo:https://youtu.be/V4XZ81vRGtMDeixe nos comentário qualquer dúvida.Um abraço! Ver mais","datetime":"09/04/2019 17:38"},{"user":"Fabio Ernanni","content":"Comecei a estudar testes unitários em React Native, encontrei bastante conteúdo usando Jest. Mas infelizmente não encontrei ainda materiais muito consistentes, ou que funcionem muito bem. Vocês tem sugestões? Podem ser artigos, livros, vídeos, etc. Eis um 🍪 pra vc","datetime":"09/04/2019 17:25"},{"user":"Thais Boscolo","content":"Olá Pessoal,  Se puderem podem em ajudar com essa pesquisa =D Gostaria de saber a opinião de vocês. ... Qual a linguagem de programação, vocês aprenderiam hoje, pensando na rápida absorção do Mercado de Trabalho ? Abraços. Ver mais","datetime":"08/04/2019 10:40"},{"user":"Fernando Paladini","content":"Sistemas de PdV (Ponto de Venda) para mercadinhos, postos, sebos, etc.  Quais sistemas BONS e modernos existem para esse tipo de aplicação que sejam Open-source? Talvez seja uma ideia boa a galera se reunir e fazer isso. Espaço teria, pois parece ser um mercado gigantesco e bem precário. A maioria que vejo por aí é pago e é uma merda tremenda, tendo que usar diversos atalhos de teclado, códigos e etc. para fazer tarefas simples. Muitos sequer toleram remoção de itens ou pagamentos dinâmicos (aceitar 50% em cartão, 50% em dinheiro, etc.).","datetime":"06/04/2019 21:12"},{"user":"Roberto Souza","content":"[dúvida séria][css] RESOLVIDO: box-shadow:0 0 15px #333; border-radius:10px; Não manjo nada de CSS, desculpem a dúvida boba. Como eu faço para fazer esse box com sombreamento e tal?","datetime":"09/04/2019 16:22"},{"user":"Carlos Henrique Costa","content":"Gente preciso de uma ajuda, de quem manja de do Java DB, criei um sistema em java inicialmente utilizando o mysql, só que agora vou colocar esse projeto no meu Portifolio por isso queria utilizar o Java DB, eu consegui criar o banco tudo certinho joguei o banco dentro do meu projeto, fiz a conexão tudo funcionando, só que quando dou um select para procurar o usuário no sistema e fazer o login ele não encontra aí meu sistema apresenta usuário e senha incorretas, alguém sabe oq pode ser ? Eu tenho uma função de checkLogin e não alterei praticamente nada pq no MySQL funcionava.","datetime":"07/04/2019 18:34"},{"user":"Evelin Lopes Quinto","content":"E-Book Grátis - Desenvolvedor(a) Full-Stack Olá pessoal, segue aqui um E-book Gratis para aqueles que querem dar o ponta-pé inicial no Universo Full-Stack.  Espero que ajude os iniciantes. Mas se você já tem alguma experiência nesse universo, também é bom dar uma olhadinha. Todo o conhecimento é bem vindo, não é mesmo?  Abraços e segue o Link.","datetime":"09/04/2019 11:47"},{"user":"William Oliveira","content":"Hoje a noite tem bate papo sobre #Nodejs com Glaucia Lemos (@glaucia_lemos86) e Rodrigo Branas (@rodrigobranas)!","datetime":"09/04/2019 15:46"},{"user":"Almir Bispo","content":"http://www.activewidgets.com/","datetime":"09/04/2019 15:36"},{"user":"António Daniel HOchi Mata","content":"Podem me dizer como é que escreve o comando \"Limpatela\" em C#","datetime":"06/04/2019 14:17"},{"user":"Magno Souza","content":"Fala Rapaziada alguém sabe resolver esse erro aqui? não estou conseguindo acionar o Mysql","datetime":"06/04/2019 18:00"},{"user":"Thiago Leonel","content":"E aí, devs, blz? Alguém aqui  ja comprou um mouse que realmente valesse a pena no Aliexpress? Comprei um teclado la e até que to gostando... [EDIT] ... Escolhi o Motospeed V30, muitos comentários a favor e tem um bom preço... Ver mais","datetime":"04/04/2019 10:38"},{"user":"Edgar Dikenge","content":"Olá...  Sim vc que esta elendo isso  Epreciso que tu me ajude a baixar programa para programação em Python O:-)  Obs:o programa tem de ser para pc de (\"32bits / 86x\")... Por favor deixe o link nos comentarios ou partilhe para quem tenha possa me ajudar ;-)  Se possivel(\"pycharm\") Ver mais","datetime":"09/04/2019 14:09"},{"user":"Mateus Andrade","content":"de boa fazendo um web scraping na sefaz Até que sai no console web  \"oxi camarada\"... function atualizarTempoSessaoNoServidor(){  $.ajax({  url: \"/sefaznet/time-left\"  }).always(function( data ) {  console.log(\"oxi camarada\");  console.log(data);  $('#modalTempoSessao').modal('hide');  atualizaTempoSessao(540);  });  } talvez o cara que zuou ta por ai asudhaisdhausd Ver mais","datetime":"10/09/2018 14:57"},{"user":"Roberto Souza","content":"[off][gato sério] Aos designers do grupo: quais ferramentas / programas vocês usam para fazer uma logo?","datetime":"07/04/2019 21:01"},{"user":"Tiago Nunes","content":"ℹ️ Olá pessoal, venham assistir ao Curso de Python 2019. Neste vídeo vamos falar sobre Funções em Python 3 - Curso Python 2019","datetime":"09/04/2019 13:51"},{"user":"Alvaro Vasconcelos","content":"LIVE SOBRE AQUEDUCT Hoje às 14:00 horas (horario de Brasília) Como definido em votação, o tema de hoje é o Aqueduct. Não perca o horário pra fazer perguntas ao vivo durante o live code.","datetime":"09/04/2019 13:42"},{"user":"Kevin Pereira","content":">declare uma matriz >compilador: \"n gostei toma 20 warnings\" >declare um ponteiro de ponteiros, aloque um vetor de ponteiros para este ponteiro de ponteiros e aloque para cada ponteiro deste vetor de ponteiros do ponteiro de ponteiros um vetor de dados >compilador: \"nice\" Logica de programar em C em uma casca de noz.","datetime":"08/04/2019 11:24"},{"user":"Leonardo Ribeiro","content":"Estruturas de dados é pra doido kkkkkkkk","datetime":"06/04/2019 12:19"},{"user":"Isabella Honorato","content":"alguém sabe de cursos de Análise e Desenvolvimento de Sistemas presencial? ainda estou no Ensino Médio, mas queria fazer um curso presencial de preferência agora.  o Senai de Tecnologia da Informação realmente ajuda? obrigada.","datetime":"04/04/2019 23:06"},{"user":"Gabriel Ferreira","content":"Ter tempo pra estudar tanto framework, linguagem e metodologia nova pode ser complicado, não é? Bem, eu fiz algumas coisas que me ajudaram a ter mais tempo pra estudar e fazer meus projetos :) Dá uma conferida: ","datetime":"09/04/2019 13:16"},{"user":"Geovany Silva","content":"","datetime":"09/04/2019 13:13"},{"user":"Ian Guimarães","content":"Só eu achei o JavaScript uma linguagem muito estranha? Parti para ela após aprender os conceitos sobre Java e PHP.  A linguagem te permite criar uma função em uma variável e os operadores lógicos dela se comportam de um maneira muito estranha, não tem classe pré-definida e muito menos package e recomendam que ao invés de usar uma classe, utilizar função, tem 2 tipos de variáveis, wtf '--'.","datetime":"07/04/2019 00:21"},{"user":"Herbert Durante Perazzelli","content":"Vagas para as Tecnologias que estão em alta no mercado: - Java: https://nerdin.com.br/vagas?Plataforma=Java - .Net: https://nerdin.com.br/vagas?Plataforma=.Net... - Oracle: https://nerdin.com.br/vagas?Plataforma=Oracle - SQL Server: https://nerdin.com.br/vagas?Plataforma=SQL - Node.JS: https://nerdin.com.br/vagas?Plataforma=Node - Python: https://nerdin.com.br/vagas?Plataforma=Python - Angular: https://nerdin.com.br/vagas?Plataforma=Angular - Android: https://nerdin.com.br/vagas?Plataforma=Android - PHP: https://nerdin.com.br/vagas?Plataforma=PHP - SAP: https://nerdin.com.br/vagas?Plataforma=SAP - Todas: https://nerdin.com.br/vagas?Plataforma=Java NerdIn: O mais novo portal de vagas de TI 100% GRATUITO. Você é Empresa/Recrutador? Confira: https://nerdin.com.br/sistema Todo ciclo de R&S de maneira automatizada, inteligente e 100% GRATUITA. Ver mais","datetime":"09/04/2019 12:32"},{"user":"Erick Wendel","content":"Acompanha lá!!","datetime":"08/04/2019 11:56"},{"user":"Henrique Marino","content":"Existe algo que substitua o onclick no HTML pra poder chamar funções no JavaScript? Porque se tá visível no HTML ele pode ser bugado, né","datetime":"08/04/2019 12:15"},{"user":"Emiliano Fuchs","content":"eu travei muito nessa questão de programação orientada a gambiarras em c# travei em como colocar o número random em dinheiro e idade nas classes (vim de outra linguagem) entre outras coisas se alguem conseguir me dar um help ai, agradeço","datetime":"09/04/2019 10:11"},{"user":"Bernardo Trindade","content":"Olá, bom dia! Estou tendo problemas para configurar as Variavéis de Ambiente ORACLE_HOME e ORACLE_SI ao instalar SQL Developer da Oracle. Meu Sistema Operacional é Ubuntu 18.04. Estou utilizando esse artigo como base (https://medium.com/…/installing-oracle-sql-developer-on-ubu…). Alguém já teve esse problema ? Cheguei nessa questão das variavéis devido ao erro \"The network adapter could not establish the connection\", que tive ao realizar o procedimento nesse artigo (https://www.oracle.com/…/sql-d…/howto-connect-xe-095131.html).","datetime":"09/04/2019 11:21"},{"user":"Marcelo Almeida","content":"Eai, galera, beleza? Vocês consideram a faculdade como algo essencial na carreira de um programador? Estou pensando seriamente em fazer alguns cursos da área ao invés de cursar a facul. Deixem suas opiniões, por favor. :)","datetime":"03/04/2019 23:38"},{"user":"Luiz Fernando da Silva","content":"https://www.theguardian.com/…/…/bye-bye-mongo-hello-postgres O que é guerra infinita perto disso?","datetime":"09/04/2019 10:05"},{"user":"Robson Cristian Tomaz Pereira","content":"Como Lidar com um Chefe que Fica o Tempo Todo no Pé  Uma coisa que infelizmente é bem comum, até mesmo em startups descoladinhas. Quando a meta do investir aperta, a microgestão aparece... Esse é um dos comportamentos mais nocivos e irritantes dentro de um time.... E, para ajudar quem passa (ou vai passar) por isso, tenho algumas dicas: 1 - Se ele está achando que você não atingirá o resultado, tenha uma conversa sobre o processo, como você pretende atingir o objetivo e combine uma forma de relatar o progresso que seja mais agradável para os dois. 2 - Se ele está com o \"dele na reta\", mostre que você entende a situação e também sofrerá as consequências de um eventual fracasso. Em seguida, siga a primeira dica. 3 - Se o seu chefe é ruim mesmo e não sabe administrar, siga a primeira dica com um pouco mais de jogo de cintura, considerando a incompetência dele no assunto. 4 - Se o seu chefe tem algum trauma, mostre que não foi você quem pisou na bola com ele no passado e siga a dica 1. Se conseguir, mostre como esse comportamento poderá destruir o time no longo prazo. 5 - Se você já pisou na bola antes, então se vira! Tenta fazer a dica 1 funcionar e não dá mancada dessa vez! Reconstruir é mais difícil que construir. Bem, eram essas as dicas! P.S: Sei que muita gente ama tecnologia, eu sou um desses, mas pela minha experiência nesse tipo de chefe é melhor ir no \"offline\". Combine uma reunião curta que é show! Ver mais","datetime":"08/04/2019 11:38"},{"user":"Vinicius C. Mesel","content":"","datetime":"09/04/2019 09:16"},{"user":"Luiz Fernando da Silva","content":"Bom dia, meus consagrados. Alguém aqui usa a API REST do PostgreSQL? O que tá achando? Vale a pena em relação ao jeito old-school de conectar e fazer queries? http://postgrest.org/en/v5.2/index.html","datetime":"09/04/2019 09:08"},{"user":"Renan Castro","content":"[iot] Automação residencial que fiz","datetime":"27/02/2019 15:08"},{"user":"Victor Queiroz","content":"Quão eficiente vocês consideram usar Qt 3D para construir um jogo?","datetime":"07/04/2019 17:14"},{"user":"Rodolfo Patricia Ramon Renan","content":"Bom dia, amigos utilizo esta ferramenta para receber dos meus clientes com boleto bancário, pode ser muito útil para vocês assim como é para mim, forte abraço depressivo e anônimo!!!","datetime":"09/04/2019 08:25"},{"user":"Lucas Dutra","content":"Fala galera! Sou estudante de Engenharia de Software na Universidade de Brasília e eu e meu grupo estamos fazendo um projeto sobre o Habitica na disciplina de Requisitos de Software. Então, peço, por favor, três minutinhos da sua atenção, usuário de Habitica para responder esse forms rapidinho! Você vai estar nos ajudando demaaaaaaaissss! Além disso, o fruto desse trabalho pode vir a se tornar futuras melhorias para o app. Passem para os seus amigos que também usam o Habitica... (Pode ser até gringo!) https://forms.gle/86iKbhchrGvHoj9i6 Muito obrigado desde já! Ver mais","datetime":"09/04/2019 02:27"},{"user":"Gabriel Sarzi","content":"Notebookfags eu os convoco Preciso de um note pra estudo/trabalho. O programa mais pesado que vou rodar nele e o SQL Server. Ou seja, um i5 com 8gb de ram funciona muito bem.  To em duvida entre os tres abaixo. Qual vocês recomendam?... Ps: trocarei o HD por um SSD de 240gb.  - Notebook Asus VivoBook 15 Intel Core i5 8250U 8ª Geração 8GB de RAM HD 1 TB 15,6\" Windows 10 X510UA  https://www.zoom.com.br/…/notebook-asus-x510ua-intel-core-i… - Notebook Dell Inspiron 3000 Intel Core i5 7200U 7ª Geração 8GB de RAM HD 1 TB 15,6\" Windows 10 i15-3567-M40C  https://www.zoom.com.br/…/notebook-dell-i15-3567-m40c-intel… - Notebook Lenovo IdeaPad 300 Intel Core i5 8250U 8ª Geração 8GB de RAM HD 1 TB 14\" Windows 10 IdeaPad 330S  https://www.zoom.com.br/…/notebook-lenovo-ideapad-330s-inte… Ver mais","datetime":"08/04/2019 13:32"},{"user":"Geovane Júnior","content":"{Serious cat}[React] Qual a forma mais simples e correta de estilizar meus components? Alguém teria um material didático de qualidade sobre isso? Eu não entendo muito de front e tenho pesquisado bastante na web, mas não consigo achar material completo (geralmente ensinam as coisas pela metade), mas vi que costumam usar MaterialUI com React... qual seria a diferença entre ele e o Bootstrap, por exemplo? Agradeço desde já!","datetime":"08/04/2019 20:55"},{"user":"Jefferson Duarte","content":"https://bit.ly/2U8ZU9e","datetime":"09/04/2019 07:41"},{"user":"Roberto Leal","content":"Eae gente, tranquilos? Eu quero fazer Ciência da Computação, Sistemas da Informação e Engenharia da Computação.Qual devo fazer primeiro e em segundo? Edit- Excelente, ja tava com o cu na mão e agora nem cu mais eu tenho","datetime":"04/04/2019 19:55"},{"user":"Kenedy Ribeiro","content":"Pessoal, vcs sabem dizer qual lugar mais em conta pra hospedar uma aplicação node.js? Eu ia colocar na hostgator mas não fornecem suporte a node nos planos mais em conta..","datetime":"08/04/2019 10:03"},{"user":"Carlos Lima","content":"9 dicas importantes! #ti #cibersegurança #IoT #tech","datetime":"09/04/2019 00:26"},{"user":"Lucas Teske","content":"[OFF] Oh fuck","datetime":"07/04/2019 21:50"},{"user":"Felipe Dos Santos Ladislau","content":"[Dúvida] [DNS]Pessoal tenho uma dúvida, alguns serviços na net oferecem domínio personalizado por DNS, tipo Mailee que você fala seu domínio para eles e no seu painel de controle cria uma variável CNAME apontando o subdomínio.Porém quando tento fazer o mesmo em 2 sites meus (Em um crio um subdomínio e no outro a variável CNAME) o apontamento não rola.Existe algo que seja necessário configurar em alguma das hospedagens? Porque eu até procurei na net mas não achei nada para isto.Obrigado e ótima semana! :)","datetime":"08/04/2019 10:41"},{"user":"Joseph Teodoro","content":"[OFF] Olha só isso no site de freelancer kkkkkkkkkkkkkkkkk LASCOU","datetime":"08/04/2019 09:37"},{"user":"Filipe Filipe","content":"","datetime":"08/04/2019 23:25"},{"user":"Augusto Lima","content":"[PHP][Resolvido] Bom dia, eu uso a função fopen para abrir um arquivo txt e fazer a leitura... Porém está dando erro em arquivo de 4mb, de 1mb ele lê certinho.  Acredito que devo alterar o tamanho a ser lido em algum lugar.  Alguém pode me orientar?","datetime":"08/04/2019 09:15"},{"user":"Paulo Tavares","content":"Empresa em expansão está em busca de novos desenvolvedores dentro do estado de São Paulo para trabalhar HOME OFFICE. Mais detalhes desse projeto e  de outros, somente após analise do Currículo / Portfólio que pode ser enviado para rh@devio.com.br.","datetime":"08/04/2019 20:41"},{"user":"Samuel Oliveira","content":"Familiarizar-se cedo com o uso dos operadores, são obrigações de todos os interessados por linguagem C. Ter domínio sobre as quatro classes de operadores é fundamental para quem programa em C, isto é básico, não podemos pular. Em posts anteriores já venho falando sobre operadores, e neste aqui,... concentro as atenções aos operadores aritiméticos. Todos os operadores aritméticos trabalham sempre com dois operacionais um na direita e outro na esquerda por isto são considerados binários. Os cálculos de expressões aritiméticas em C obedece regras rígidas de precedências de operadores para que os cáculos sejam exatos. Más isto não é um problema para o programador já que o mesmo pode utilizar parênteses para definir que estes cálculos devam ser realizados primeiro, isto nada mais é do que o fato em que estamos alterando a ordem das operações já que os parênteses tem o maior nível de precedência. Basicamente os parênteses vem primeiro, se houver vários, os cálculos acontece da esquerda para direita já que o nível de precedência são iguais. depois vem: multiplicação, divisão, adição e subtração. Os operadores aritiméticos são: Continue a leitura no link abaixo Ver mais","datetime":"08/04/2019 20:30"},{"user":"Marcello Minick","content":"[Ajuda][Python+Html] Criei um botão em Html quero relacionar  com um dicionário em python . Como faço ? ... Por Exemplo : o usuário escreve algo e click no botão o script teve ir  buscar a palavra no dicionário. Como faço desde já obrigado pela ajuda . Ver mais","datetime":"08/04/2019 10:34"},{"user":"Moreira Silva","content":"Ola pessoal! Uma pergunta de newbie. Qual afuncao de SASS e SCSS? Sao eles importantes atualmente? obgd.","datetime":"08/04/2019 16:13"},{"user":"Roger Cavaler","content":"Boa noite depressivos. Alguém consegue dar uma olhadinha na interface do site https://colmeiax.com/?? Estou coletando opiniões a respeito da interface. Quem estiver afim de ajudar é só responder o formulário abaixo: https://forms.gle/ndHjG2kEFYVJaGM17... Vlw galera!!!! Ver mais","datetime":"08/04/2019 19:30"},{"user":"Richard Lemos","content":"Bem tratada. Exception ex - Bradesco","datetime":"05/04/2019 20:38"},{"user":"Nícolas Gama","content":"Empresas aceitam certificados da Udemy?Empresas aceitam certificados da Udemy?","datetime":"06/04/2019 20:31"},{"user":"Paulo Kaedo Lima","content":"Galera, to querendo começar a fazer freelance... Aos que fazem, com começaram? Ta valendo a pena ultimamente? Deixem suas opiniõesGalera, to querendo começar a fazer freelance... Aos que fazem, com começaram? Ta valendo a pena ultimamente? Deixem suas opiniões","datetime":"08/04/2019 17:33"},{"user":"Cleber Araújo Palmeiras","content":"Faz uns 5 anos que fiz , manerem nas críticas. Só procurei a imagem novamente, pra pedir pros meus alunos fazerem... 🤣🤣🤣🤣🤣.","datetime":"04/04/2019 15:58"},{"user":"Paulo Brito","content":"Vai ter um Roadsec perto de você #roadsec #flipside #ctf #hackaflag #eventodeseguranca","datetime":"08/04/2019 20:28"},{"user":"André Monteiro","content":"Ola, Fiz um video mostrando como o projeto estava no ano passado. Acham que evoluiu bem?","datetime":"02/04/2019 16:51"},{"user":"Paulo Brito","content":"Relatório da Netscout aponta riscos mundiais #netscout #nuvem #riscobrasil #cybersegurança","datetime":"08/04/2019 20:13"},{"user":"Douglas Henrique","content":"O que vale mais no curriculo, Alura, Udemy, Udacity, CognitiveClass, Coursera, Qwiklabs, Alison, Treinaweb, Devmedia? Todos são cursos EAD. Vale lembrar que não importa o que você tenha no curriculo o maior diferencial é o que você sabe fazer na prática e um bom portfólio. Mas sobre aprender, é melhor aprender sozinho? Você é autodidata? Eu penso que na área de T.I. temos que ser. Mas caso prefira um auxilio como cursos, onde aprender?","datetime":"08/04/2019 12:06"},{"user":"Lucas Dirani","content":"Boa tarde. Alguém conhece se há alguma forma de integração com o aplicativo UberEats? Fiz uma pesquisa, e até agora só encontrei respostas de que o Uber não disponibiliza uma API pública do Eats (apenas para o aplicativo padrão deles, que não retorna dados do UberEats em seus endpoints). Obrigado.","datetime":"08/04/2019 16:11"},{"user":"Henrique Calandra","content":"Pessoal a TecBan maior empresa de tecnologia bancaria acaba de abrir 30 vagas urgentes de estágio! https://www.walljobs.com.br/empresas/ver/tecban?","datetime":"08/04/2019 18:53"},{"user":"Marcelo Rocha","content":"Resolvido (valeu Daniel)  PHP Não consigo lembrar de como printar uma variável da seguinte forma:... Uma variável segura o valor que quero chamar: echo $obj->AQUI_A_VARIAVEL; Como eu faço para o código acima funcionar? No php tem uma função que converte a variável pra ser usada aí, mas não me recordo. Ver mais","datetime":"08/04/2019 00:40"},{"user":"William Oliveira","content":"Semana que vem tem introdução a programação com JavaScript no curso de fullstack com Nodejs e React, galera! Se inscreve no RSS do blog, na newsletter (http://bit.ly/cartinha-do-will) me segue nos Twitter (https://www.twitch.tv/w_oliveiras) ou fica de olho ae que vem mais conteúdo por aeee! :D https://woliveiras.com.br/…/do-zero-ao-fullstack-com-nodej…/","datetime":"30/03/2019 07:02"},{"user":"Andre Luiz","content":"Oi obrigado por me aceitarem , sou programador php python iniciante user linux a quase 10 anos (slack) meu portugues e pessimo.. Fazer oque estudei pouko aprendi pouco e na marra.","datetime":"07/04/2019 22:36"},{"user":"Victor Hugo Carvalho","content":"Qual a melhor linguagem que não seja tão complicada para iniciantes?","datetime":"01/04/2019 20:35"},{"user":"Lucas Cavallari","content":"Mano... funciona mesmo.. genial","datetime":"07/04/2019 22:53"},{"user":"Afrânio Alves","content":"alguem para me indicar um bom curso de Javascript","datetime":"08/04/2019 15:53"},{"user":"Jorge Angelo Niche","content":"","datetime":"08/04/2019 15:52"},{"user":"Otavio","content":"preciso montar uma query que filtre pedido primeiro por data e depois por horario, é possivel fazer uma só query ?","datetime":"08/04/2019 11:25"},{"user":"André Monteiro","content":"Ola pessoal, tudo bem?   Fiz algumas habilidades. Ficou bom?","datetime":"29/03/2019 15:58"},{"user":"Paulo Roberto Sampaio Bezerra","content":"Boa tarde APDA! No vídeo dessa semana falo sobre o que acho que é o caminho certo a ser seguido por quem deseja aprender a programar.","datetime":"08/04/2019 15:21"},{"user":"Andre Luiz","content":"[Resolvido] Tudo funciona menos a função de multiplicação na linha 57  https://pastebin.com/gBphzE9j","datetime":"08/04/2019 15:05"},{"user":"Bianca Decoló","content":"dudes, me ajudem. preciso montar meu portfólio. boto tudo em hosp grátis e linko ou boto dentro do meu site mesmo? btw, vcs tem dica de hosp grátis?","datetime":"08/04/2019 07:43"},{"user":"Clayton Augusto Soares","content":"Salve galera, tudo tranks? Alguém aqui já fez alguma implantação no sistema da Tray? Se sim, tem como me chamar no pv por favor para negociarmos? Abraço!","datetime":"08/04/2019 14:17"},{"user":"Gabriel Ferreira","content":"Não se sente preparado para AQUELA vaga ou tem medo de arriscar aprender uma tecnologia diferente? Dá uma lida no meu post de hoje :) Vem comigo: ","datetime":"08/04/2019 14:10"},{"user":"Hamilton Silva","content":"Alguém já trabalhou com visão computacional com a linguagem C# ? O que me aconselham ?","datetime":"07/04/2019 18:35"},{"user":"Gabriel Ferreira","content":"Hoje tem episódio novo do Hipsters Ponto Tube! Eu e o Paulo Silveira onversamos sobre Git e Github. Um ótimo vídeo pra aquele seu amigo ou amiga que tá começando :) Olha só: ","datetime":"08/04/2019 13:00"},{"user":"Roger Luiz","content":"","datetime":"07/04/2019 13:17"},{"user":"Junior Hanun","content":"Olá, Bom dia!  Tudo bem com você.  O meu nome é Winston Hanun Júnior, sou Desenvolvedor Web. ... Estou em busca de uma oportunidade de voltar ao mercado de trabalho.  Gostaria de saber se alguém tem alguma vaga de Desenvolvimento, de preferência remoto.  Tenho disponibilidade de inicio imediato Meu curriculum. https://github.com/devjuniorhanun/Curriculum Ver mais","datetime":"08/04/2019 10:00"},{"user":"João Victor","content":"Pode ser uma dúvida boba, mas qual o valor do job mais caro que vocês já fizeram e do que se tratava (p. ex., site, app, sistema web, etc.)?","datetime":"07/04/2019 14:02"},{"user":"Joseph Teodoro","content":"[OFF] Concordam ?","datetime":"07/04/2019 23:08"},{"user":"Oziel Pimentel","content":"Boa noite a todos, eu estou aprendendo a linguagem basic e to fazendo um jogo com essa linguagem, eu queria fazer em c++ mas é difícil demais pra mim, obrigado por me aceitar no grupo, e eu espero aprender muito aqui.","datetime":"07/04/2019 22:58"},{"user":"Gustavo Avila","content":"[Serious cat][javascript][babel 7][webpack] Existe algum curso ensinando como configurar o babel 7? To desde janeiro tendo que lembrar de não usar Object.entries por que o polyfill não compila junto...","datetime":"08/04/2019 01:57"},{"user":"Alvaro Viebrantz","content":"E saiu mais um vídeo da série de novidades de IoT.  Essa semana temos projetos que ensinam a falar com plantas usando IoT, Realidade Aumentada e Virtual com IoT,  Ferramentas de OTA, Projetor com pegada DIY e muitas tendências em IoT segundo grandes empresas. https://youtu.be/YFGyIBFCV-U... Se inscreve no canal e não percam outros videos dessa série. Ver mais","datetime":"08/04/2019 11:03"},{"user":"Otavio","content":"[SERIOUS CAT] Como executar uma função de um form que ja esta aberto, através de outro form ? C# obs: form ja está instanciado","datetime":"08/04/2019 10:49"},{"user":"Edgar Carvalho","content":"Galera, já procurei, mas não sei o termo certo... Mas certa vez alguém criou um código para caso o cliente não pague acontecia algo com o código que não lembro. Alguém tem o link do github deste repositório?","datetime":"06/04/2019 12:10"},{"user":"Victor Mendonça Nogueira","content":"Comecei numa faculdade particular bem baratinha, consegui meu primeiro estágio e usei boa parte do salário pra estudar, com isso consegui um estágio que paga bem, tão bem que agora consigo pagar uma faculdade \"boa\" por conta própria, pretendo sair da minha faculdade e continuar o curso em alguma superior, quais me recomendam?  PS: Moro em SP.","datetime":"05/04/2019 18:18"},{"user":"João Victor","content":"Parece um bom negócio.","datetime":"04/04/2019 12:47"},{"user":"Laiany Tatagiba","content":"Estou fazendo ADS pela Estácio a distância, o problema é que as vídeos aulas são muito cansativas, não prende atenção, está sendo um martírio pra estudar.  Alguém indica um outro lugar pra pegar a matéria sem ser o passei direto. Só quero um lugar com um conteúdo dinâmico e bom.","datetime":"05/04/2018 17:45"},{"user":"Joana LiLian","content":"Algum projeto open source ou voluntario que vocês conhecem ou indicam pra quem precisa montar portfolio?Algum projeto open source ou voluntario que vocês conhecem ou indicam pra quem precisa montar portfolio?","datetime":"04/04/2019 12:36"},{"user":"Italo José","content":"[EVENTO DE GRAÇA] https://lnkd.in/dDrMSrf Quer aprender mais sobre o Tensorflow e ainda conhecer a Google? Cola no meetup do #TensorflowSãoPaulo dia 11/04 \\0/ é de graça! Só não esquece de se inscrever na página do meetup.com antes em https://lnkd.in/dDrMSrf... #deeplearning #google #mvpbuzz #community Ver mais","datetime":"08/04/2019 09:17"},{"user":"Gabriel Ferreira","content":"","datetime":"08/04/2019 09:13"},{"user":"João Vítor Maia","content":"Aconteceu algum data leak recentemente? To recebendo sms de verificação do gmail faz um tempo, da primeira vez ja alterei minha senha, mas hoje recebi de novo.","datetime":"07/04/2019 11:44"},{"user":"Arthur Serafim","content":"[OFF] Como vocês mantêm controle dos seus commits no github? Sempre que vou dar um commit, eu paro e penso: \"O que que mudou de lá pra agora?\" No final, sempre saio com algo genérico do tipo: \"Funcionalidades extras incrementadas\". Tem vez (em projetos próprios) que simplesmente coloco \"não lembro oq q eu fiz\". E vocês, também sofrem disso?","datetime":"06/04/2019 15:04"},{"user":"Jefferson Duarte","content":"https://bit.ly/2Vzyj2Q","datetime":"08/04/2019 08:29"},{"user":"William Oliveira","content":"Saindo mais um texto da série fullstack JavaScript, galera. Introdução a programação de computadores: operadores matemáticos, de comparação, condicionais e lógicos","datetime":"08/04/2019 06:58"},{"user":"Marco Aurélio Thompson","content":"Curso de C para iniciantes, grátis para mil alunos.","datetime":"06/04/2019 22:26"},{"user":"Marcos Souza","content":"Nova tendencia UX: deixar que os usuários adivinhem os dados que tem que inserir","datetime":"01/04/2019 21:52"},{"user":"Mario Souto","content":"Olá pessoas!  Tô começando uma série pegando vários tópicos comuns no desenvolvimento de projetos com React e quero compartilhar com vocês :)  O primeiro é uma solução que eu curto bastante pra lidar com classes condicionais e uma forma de deixar os seus classNames dos componentes mais legíveis dá uma olhada aí /o","datetime":"08/04/2019 07:20"},{"user":"Rennan Barros","content":"To usando a Api do Gmail para uma nova função da minha IA, o que acharam? Poderiam falar sobre o que esperavam em um script para checar emails? Edit 1 - Código: https://github.com/ProfessorJamesBach/CheckerGmail","datetime":"06/04/2019 17:09"},{"user":"Lucas Gonçalves da Silva","content":"O Zen do Python, por Tim Peters Bonito é melhor que feio. Explícito é melhor que implícito. Simples é melhor que complexo.... Complexo é melhor que complicado. Linear é melhor do que aninhado. Esparso é melhor que denso. Legibilidade conta. Casos especiais não são especiais o bastante para quebrar as regras. Ainda que praticidade vença a pureza. Erros nunca devem passar silenciosamente. A menos que sejam explicitamente silenciados. Diante da ambigüidade, recuse a tentação de adivinhar. Deveria haver um — e preferencialmente só um — modo óbvio para fazer algo. Embora esse modo possa não ser óbvio a princípio a menos que você seja holandês. Agora é melhor que nunca. Embora nunca freqüentemente seja melhor que já. Se a implementação é difícil de explicar, é uma má idéia. Se a implementação é fácil de explicar, pode ser uma boa idéia. Namespaces são uma grande idéia — vamos ter mais dessas! Ver mais","datetime":"07/04/2019 21:47"},{"user":"Pedro D. Sousa de Lima","content":"Esses cursos de machine-learning, deep-learning e tensorflow da Udemy são bons? Vale a pena? Alguém já comprou e pode dar uma luz aqui?","datetime":"08/04/2019 05:16"},{"user":"Cristiano Martins Pain","content":"Bom dia, gostaria de saber se é dificil criar um site como esse, https://www.kitefeitos.com/ quero criar uma pagina de vendas parecida  mas não sei programar ainda, e quanto custa criar essa pagina ? obrigado.","datetime":"08/04/2019 03:39"},{"user":"Whélynton Júnior","content":"[GATO DA SERIEDADE] Pessoal, preciso de uma solução de Loja Virtual que tenha um módulo de pagamento recorrente. Eu uso o Open Cart, mas parece que no open cart não há esse recurso.  Alguém pode indicar uma solução de ecomerce boa nesse sentido?","datetime":"08/04/2019 02:10"},{"user":"Antoniomateus Francisco","content":"","datetime":"08/04/2019 01:59"},{"user":"Lucas Matheus","content":"Alguém aqui manja de estágio? Fui aceito para um estágio de redes em uma universidade. Estou apenas esperando a resposta do Ciee em relação a documentação e exercício do ofício... Isso está certo? Quanto tempo de resposta do Ciee? Já discuti tudo com o \"chefe\", até mesmo as tarefas que me foram delegadas.","datetime":"07/04/2019 23:15"},{"user":"Matheus Veloso","content":"Hello Word algum grupo no discord  ou WPP  de programação ?","datetime":"07/04/2019 23:54"},{"user":"Gabriel Lopes","content":"Boa noite, estou envolvido atualmente em dois projetos onde usaremos machine learning (provavelmente com python). Acontece que sou muito cru ainda na area, tive contato com programação basicamente no ano passado, gostaria de indicações de cursos ou livros sobre o assunto se possível. Obrigado desde já.","datetime":"07/04/2019 22:00"},{"user":"Marcelo Falcão","content":"alguém ja instalou o wpscan no centos 7? eu instalei mas na hora de usar vem esse erro: /usr/local/lib/ruby/site_ruby/2.4.0/rubygems/core_ext/kernel_require.rb:54:in `require': cannot load such file -- readline (LoadError)...         from /usr/local/lib/ruby/site_ruby/2.4.0/rubygems/core_ext/kernel_require.rb:54:in `require'         from /usr/local/lib/ruby/gems/2.4.0/gems/wpscan-3.5.0/lib/wpscan.rb:14:in `<top (required)>'         from /usr/local/lib/ruby/site_ruby/2.4.0/rubygems/core_ext/kernel_require.rb:54:in `require'         from /usr/local/lib/ruby/site_ruby/2.4.0/rubygems/core_ext/kernel_require.rb:54:in `require'         from /usr/local/lib/ruby/gems/2.4.0/gems/wpscan-3.5.0/bin/wpscan:4:in `<top (required)>'         from /usr/local/bin/wpscan:23:in `load'         from /usr/local/bin/wpscan:23:in `<main>' Já tenho o ruby instalado ultima versao, o que fazer pra resolver esse erro? Obrigado! Ver mais","datetime":"07/04/2019 22:52"},{"user":"Tiago Mateus","content":"Debian ou Fedora?","datetime":"03/04/2019 01:29"},{"user":"Lazaro Shevchenko","content":"[Help] Linguagem C# - Desktop Situaçao:  Tenho software de integração com IFood - tudo funcionava até o bendito decidir remover o telefone do cliente do objeto que normalmente vinha( coisa judicial de proteção de dados),ai vem o problema meu sistema assim como 99% dos sistemas de delivery que conheço usava o telefone como \"campo chave\", o iFood agora manda o CPF do cliente vez ou outra recebo o telefone que o cliente mesmo preenche nas observações do pedido (campo de texto) daí pensei em percorrer esse objeto e tentar ver se tem  telefone preenchido lá a pergunta é, qual a forma mais performática de fazer isso ( as vezes começa com ddd, as vezes com numero corrido ) ... Me ajudem","datetime":"06/04/2019 17:30"},{"user":"Marcelo Rocha","content":"RESOLVIDO  Eaí folks, Questão com SSL: Ao fazer um acesso a um site com www, o certificado SSL falha. Ele foi gerado para o site sem WWW.... Aí fica a pergunta: ao gerar o certificado SSL para um domínio com letsEncrypt, eu preciso gerar 2, um com www e outro sem? Update: Ou eu faço ao entrar sem www redirecionar para com www e faço o certificado só pro www. Ver mais","datetime":"06/04/2019 15:16"},{"user":"Wasley David","content":"Estou fazendo um curso online de machine learning em R. Aqui está a tabela de dados original.  Foi usado o seguinte código dataset = read.csv('data.csv')... dataset$Age = ifelse(is.na(dataset$Age),                      ave(dataset$Age, FUN = function(x) mean(x, na.rm = TRUE)),                      dataset$Age) dataset$Salary = ifelse(is.na(dataset$Salary),                      ave(dataset$Salary, FUN = function(y) mean(y, na.rm = TRUE)),                      dataset$Salary) Eu entendi completamente o que foi feito, porém, não tem opção melhor para lidar com os valores NA's? Não pode ser prejudicial nomear os valores NA's como médias das colunas numa análise de dados? Eu realmente estou começando agora então estou apenas com dúvidas acerca disso.  Segue abaixo a tabela final. Ver mais","datetime":"07/04/2019 23:24"},{"user":"Pedro Castilho","content":"Saiu o código completo do Ghidra.","datetime":"05/04/2019 13:32"},{"user":"Elton Kamuango","content":"[RESOLVIDO] Escrevi esse código, para achar x numa equação do segundo grau. . As variáveis estavam todas como float, porém, ao compilar no prompt, exigiu a conversão de float para double. .... Tem como resolver sem ser converter para double? Ver mais","datetime":"07/04/2019 10:02"},{"user":"Caio Oliveira Felix","content":"Olá, to começando a programar em java, e obtive o seguinte erro http://prntscr.com/n8p677, dei umas pesquisadas, porem não encontrei solução, e nem o porque está acontecendp","datetime":"07/04/2019 13:07"},{"user":"Luis Fernando Konopacki","content":"Galera criei um canal no discord para programadores, para quem gosta de tirar dúvidas ou compartilhar ideias, ou pra vc programador que não tem vida social e fica a noite programando kkkkk, segue o Link abaixo.","datetime":"07/04/2019 03:09"},{"user":"Ocaue Pereira Barretto","content":"","datetime":"07/04/2019 22:34"},{"user":"Arthur Bueno","content":"Pessoal, bom dia. Preciso adicionar um botão em um woocommerce, ele está em \"modo catálogo\", sem preços, sem quantidade, sem nada, apenas nome e descrição. Quero um botão \"Fazer pedido\" e que redirecione para o whatsapp, enviando o link do produto pro whatsapp da loja. Alguém tem uma ideia de como fazer isso? Eu não manjo nada de PHP. Se alguém souber fazer e me der uma luz, eu ajudo com um pouco de $$","datetime":"07/04/2019 11:37"},{"user":"Ygor Regato","content":"É comum toda noite sonhar com códigos  ?  Não aguento mais !É comum toda noite sonhar com códigos  ?  Não aguento mais !","datetime":"01/04/2019 03:39"},{"user":"Vinícius Terranova","content":"A documentação da Stripe permite testar a ferramenta de validação do cartão e muitas outras coisas direto da documentação. Alguém conhece alguma ferramenta para escrever documentação que permita essas interações direto na documentação em sí?https://stripe.com/docs fica bem nessa página dando um scroll pra baixo pra quem quiser testar.","datetime":"06/04/2019 22:51"},{"user":"Rafael Almeida","content":"HTML, CSS, JavaScript, MySql, PHP qual seria a continuação de aprendizado para ser um Full Stack?HTML, CSS, JavaScript, MySql, PHP qual seria a continuação de aprendizado para ser um Full Stack?","datetime":"07/04/2019 02:46"},{"user":"Lucas Madara","content":"Toda aquela documentação feita na disciplina de engenharia de software é feita no dia a dia das empresas?","datetime":"01/04/2019 18:31"},{"user":"Pedro Chess","content":"Poxa mano...","datetime":"01/04/2019 20:01"},{"user":"Eduardo Silva","content":"[#HELP] Tem algum programador aqui que entenda esse script ? Se sim... me chame privado irei pagar super bem pela ajuda! (não quero nada de graça). #NAME: ZOOLANDER X#...Continuar lendo","datetime":"04/04/2019 00:02"},{"user":"Luz Dos Anjos","content":"Adeus programadores vocês não serão mais necessários, obrigado a todos Att: Google :)","datetime":"02/04/2019 03:44"},{"user":"Aisten André","content":"Boa noite, pensando em cursar  Analise de Sistemas... Dicas para preparar melhor ?Boa noite, pensando em cursar  Analise de Sistemas... Dicas para preparar melhor ?","datetime":"05/04/2019 20:41"},{"user":"Uil S. Souza","content":"Criação de um sistema simples em PHP. Muito da hora  ✍️😁","datetime":"02/04/2019 17:28"},{"user":"Rafael Oliveira","content":"---RESOLVIDO #GIT #BITBUCKET Reparei que meu repositório local está faltando alguns arquivos que estão meu repositório remoto.Já fiz o Pull e Fetch e nada de baixar os arquivos faltantes para o meu repositório local. O que posso fazer para baixar forçosamente esses arquivos para o meu repositório local?  Estou tentando fazer isso através do eclipse.","datetime":"07/04/2019 20:23"},{"user":"Guilherme Schulke","content":"[Help] Alguem poderia me dizer se eu fiz essa questão corretamente e se eu errei poderia me dizer onde ?","datetime":"07/04/2019 17:41"},{"user":"Jhonatan Pereira","content":"Usar a função SUM do MySQL pra somar campos decimais é viável para lidar com valores monetários? É realmente preciso? Pergunto pois tive péssimas experiências com floats no javascript","datetime":"07/04/2019 19:52"},{"user":"Daniel Augusto","content":"Eae galera, to precisando de ajuda em uma tarefa sobre a metodologia RUP. É só uma simples duvida, que eu não conseguiria tirar a tempo com meu professor, então recorri a este grupo, onde poderão me ajudar... A duvida é a seguinte: O que seria Elementos, Papéis e Atividades na metologia RUP? Eu estou fazendo a pesquisa e acho termos diferentes, se puderem me dar um exemplo de cada, eu ficarei grato ;)","datetime":"07/04/2019 18:53"},{"user":"Emerson Ribeiro Souza Anjos","content":"Olá  parceiros, profissionais  professores e estudantes , tenho um código de um jogo q fiz em C mas preciso converter ele pra uma linguagem OO tentei converter pra c++ mas pelo que vi me parece q c++ em OO só trabalha com ponteiros em java ia ficar tenso de fazer o mesmo programa , esse trabalho é pra amanha  e ainda n achei maneira de faze-lo a tempo pois ja tinha convertido  tudo pra c++ na mão mesmo sem conhecer a linguagem. DESDE JA Obrigado. [EDIT]link: https://ghostbin.com/paste/2eb74/raw","datetime":"07/04/2019 19:32"},{"user":"Thiago Cunha","content":"Tem framework que faz Java ser do Capeta!","datetime":"06/04/2019 19:02"},{"user":"Rodrigo Cesar Ferreira","content":"Boa noite sou novo e estou montando meu primeiro site gostaria de fazer um banner de vídeo. Alguém pode me passar algumas informações como se eu posso estar pegando qualquer vídeo da internet para usar? Se tem que pagar direitos autorais? O se tem algum site que poderia estar baixando vídeo gratuito ou de um preço bem acessível? Desde de já muito obrigado pela ajuda.","datetime":"07/04/2019 19:41"},{"user":"João Victor","content":"Eu nunca acerto quando a imagem é assim :(","datetime":"04/04/2019 13:29"},{"user":"Anderson Oliveira de Paula","content":"😯😀Estamos felizes, em poucos dias, 100 (cem) audições já foram contabilizadas em nossa entrevista Podcast O PROFISSIONAL FULLSTACK, com Jackson Mafra👇 Se você ainda não ouviu, faça isso Através desta entrevista você vai entender exatamente o que é um Profissional Fullstack, Qual seu Perfil, O Valor que o Mercado dá (ou pode dar) para sua Habilidades, Dicas de Leitura para se tornar um (ou se aperfeiçoar - considerando que você já seja um)... Escute!  http://bit.ly/entrevista-podcast-fullstack Você pode fazer download, ouvir no App SoundCloud em seu Android, iPhone, no seu agregador de podcast preferido, como PodcastAddict, entre outros (através do nosso Feed) Ver mais","datetime":"07/04/2019 19:45"},{"user":"Plínio Fabrycio Filho","content":"Boa noite meus consagrados. Poderiam me explicar se isso é obra de um Bot mal programado, um estagiário zuero ou jogada de marketing? //Obvio que os preços estão muito absurdos","datetime":"06/04/2019 18:43"},{"user":"Gustavo Ponttes","content":"Qual a forma correta de colocar os projetos no GithHub? Coloquei uns códigos lá ,mas disseram ser insuficiente.Qual a forma correta de colocar os projetos no GithHub? Coloquei uns códigos lá ,mas disseram ser insuficiente.","datetime":"06/04/2019 20:46"},{"user":"Almir Bispo","content":"Depois de avaliar,encontrei esta excelente ferramenta de gerenciamento de banco de dados.Aceita varios tipos de SGBD.Pode ser baixado em: ","datetime":"06/04/2019 19:50"},{"user":"Paulo Richard","content":"[HELP] Boa noite Pessoal !!! Estou a fazer Engenharia Informática e o prof de Lógica Computacional mandou- me tarefas,: A questão é sobre ordens de prioridade e os sinais lógicos E a outra é sobre Ordens de prioridade de Parênteses lógicos.... Desde já Agradeço pelo vossa ajuda Ver mais","datetime":"01/04/2019 20:07"},{"user":"Fabiano Salles","content":"[LaTex] Alguém aqui usa LaTex no windows? Não aguento mais o equation do office e preciso de um guia... tô baixando o MiKTeX, mas a previsão é de quase 4h de download... :( Tem algum editor TeX menor para o sistema do tio Bill ou a parada é por aí mesmo?","datetime":"19/06/2017 22:08"},{"user":"Gabriel Bauermann","content":"","datetime":"07/04/2019 08:23"},{"user":"Daniel Bonifacio","content":"🤔😳 Você já se preocupou com logs e PADRONIZAÇÃO de respostas na sua aplicação? No quinto vídeo da série eu dou duas soluções simples para problemas ENORMES de padronização handling de erro e log na aplicação, que deixarão o workflow e a manutenção da aplicação muito mais rápidos. https://youtu.be/JOdc8gOZ9pY... Sério, independente da linguagem que você trabalha, eu recomendo assistir o vídeo, pois o conceito é aplicável na maioria. Ver mais","datetime":"07/04/2019 18:12"},{"user":"Lucas Pereira","content":"Galera uma amiga está com problemas na rede de internet da casa dela(pega com a vizinha) pelo que percebi o fio verde branco foi rompido, na hora que coloco o testador dá ele como rompido, portando não dá conexão, fica conectando e desconectando continuamente,Ouvi dizer que existe um padrão que usa apenas 4 fios vocês conhecem? alguém poderia me orientar? quais as cores e ordens que posso usar? acredito que descartando o fio branco verde que está rompido, conseguirei estabilizar a internet, quero muito ajuda-la pois será um trabalhão trocar todo o fio.","datetime":"07/04/2019 17:43"},{"user":"Samuel Oliveira","content":"Ordenação por fusão, que é um dos sinônimos em português da palavra \"merge\", ou mistura. é um tipo de ordenação de alta eficiência mas de grande complexidade para entender. Ficou popularmente dito que se deve dividir... para conquistar, e seu funcionamento envolve recursividade, portanto um alto nível de memória deve ser notado pelo seu tempo de execução acima de outros, concorrentes, mesmo assim em alguns casos o uso é recomendado. Ver mais","datetime":"07/04/2019 18:00"},{"user":"Milson Pazienza","content":"Boa noite pessoal, alguem poderia partilhar algum layout de site simples, pode ser estatico que seja facil de editar de preferencia só mesmo html e css, sei que tem bastante na internet mas quero um coisa simples.","datetime":"05/04/2019 19:09"},{"user":"Tiago Nunes","content":"ℹ️ Olá pessoal, venham assistir ao Curso de Python 2019. Neste vídeo vamos falar sobre funções 👇👇 Funções em Python 3 - Curso Python 2019","datetime":"07/04/2019 17:31"},{"user":"Mackenzie Zurenberg","content":"Estátistica também serve pra programar ou estou errado? Pois na  udacity alguns dos professores de python sao estatisticos","datetime":"07/04/2019 08:13"},{"user":"Robson Cristian Tomaz Pereira","content":"Faltaram algumas optativas: XGH, mudar layout rapidinho, fazer café, como ficar rico com programação, paciência tibetana... :p","datetime":"03/04/2019 23:30"},{"user":"Arthur Mendes","content":"alguem ajuda aaa","datetime":"05/04/2019 01:09"},{"user":"Samuel Oliveira","content":"https://codigosfontes-ccplus-plus.blogspot.com/…/ordenando-… O vetor é preenchido por um contador, e em seguida seus elementos são embaralhados para que possam passar por um bloco de ordenação com quick sort.... Só queria deixar claro uma coisa. Por mais que agente altere os nomes das variáveis, num código de ordenação, como este mesmo do exemplo, que é o quick sort, tido como um dos mais produtivo no que faz, isto não quer dizer que somos os donos do código, as alterações dos nomes das variáveis ou algumas meras modificações no código original só satisfaz nossos gostos ou otimiza de acordo com o sistema usado. A história do quick sort é impressinante, ele foi desenvolvido em 1960 pelo cientista da computação britânico Charles Antony Richard Hoare, também conhecido como Tony Hoare ou C. A. R.  Mas só após uma série de refinamentos o algoritmo foi publicado em 1962. Procure por mais informações sobre o quick sort na internet, que com certeza encontrará dezenas de links sobre o assunto. Ver mais","datetime":"07/04/2019 15:04"},{"user":"Rully Alves","content":"Alguém pode me indicar livros, apostilas e outros materiais para estudo sobre modelagem de banco de dados ?","datetime":"06/04/2019 23:59"},{"user":"Douglas Borges","content":"E tem como desinstalar o Baidu?","datetime":"07/04/2019 00:12"},{"user":"Fernando Ferreira","content":"Boa tarde a todos ! Estou em processo de desenvolvimento do meu TCC, e escolhi como tema desenvolver um ServiceDesk, ai que surge minha dúvida: é um tema comum ? Gostaria de algumas ideias de desenvolvimento pro TCC","datetime":"07/04/2019 14:31"},{"user":"Arthur Serafim","content":"[Portugol] [Discussão] Vejo que as pessoas possuem opiniões muito divergentes em relação à utilidade do portugol no meio educacional, então, venho pedir a opinião de vocês. Vou listar alguns tópicos pra \"padronizar\" o negócio todo: [1] Benefícios em relação ao aprendizado direto em uma linguagem \"comercial\"... [2] Malefícios em relação ao aprendizado direto em uma linguagem \"comercial\" [3] Pra você, existe um método de ensino mais eficiente? Caso sim, qual? [4] Sua conclusão (É a favor ou contra a utilização do mesmo?) Conto com a participação de todos! Bom dia/tarde/noite Ver mais","datetime":"02/04/2019 19:20"},{"user":"Jonathan Silva","content":"[ S.O.S Database ] Estou fazendo uma espécie de Marketplace, onde o usuário comum ( Pessoa ) faz pedidos de produtos MAS TAMBÉM pode fazer uma Assinatura para poder cadastrar a(s) Loja(s) dele e vender seus produtos... Mas essa modelagem está me estressando demais... Preciso saber como fazer isso com base no fluxo que fiz A Loja pertence a apenas 1 dono ( assinante no caso ) e pode ter apenas 1 Gerente Esse Gerente e Atendente adicionados pelo Assinante são da tabela Pessoa, ou seja, elas podem fazer Assinatura também caso ainda não tenham... Eles não podem fazer pedidos de produtos em Lojas que estejam associados á eles Tipo se o cara é o dono/assinante não poderá comprar produtos da loja dele Pelo menos nesse sistema que estou fazendo, não podem Ver mais","datetime":"31/03/2019 19:41"},{"user":"Adryan Jordan","content":"[OFF]  Disseram que programadores possuem privilégios peculiares...","datetime":"02/04/2019 22:40"},{"user":"Richard Matheus Miranda","content":"Algum de vocês já inventou algo mirabolante que funcionou?","datetime":"06/04/2019 18:27"},{"user":"Davi Soares","content":"Olá pessoal, gostaria de saber de vocês, programação é pra qualquer um? É pq eu faço um curso técnico na EEEP do Ceará, mas eu quero humanidades...eae?","datetime":"06/04/2019 17:15"},{"user":"Edgar Carvalho","content":"Fala meus lindos, bom domingo a todos :D Seguinte, estou com uma lista de e-mails e estou querendo separar ela em arquivos de 50.000, alguém tem alguma solução?","datetime":"07/04/2019 11:01"},{"user":"Gabriel Ferreira","content":"Olá jovem! Chegou a hora de conferir os links mais legais da semana :) Vem comigo: http://gabsferreira.com/conseguindo-emprego-com-programaca…/","datetime":"07/04/2019 10:53"},{"user":"Juliane Faustino","content":"Então to precisando da ajudinha de vocês mais uma vez para mais uma pesquisa do meu TCC, quem puder colaborar respondendo e compartilhando meu grupo agradece.","datetime":"04/04/2019 19:51"},{"user":"Elbert Lamovnier","content":"","datetime":"05/04/2019 23:36"},{"user":"Jefferson Duarte","content":"https://bit.ly/2CiHMpg","datetime":"07/04/2019 10:19"},{"user":"Kamilla Bastos Jesus","content":"Boa noite pessoal, estou vendendo cada livro a R$20,00. Aos interessados entrego no centro de Niterói de seg a sexta, ou podem visitar o meu bazar @bazar.comniteroi. Para mais informações chamar inbox 👍","datetime":"04/04/2019 18:39"},{"user":"José Luiz  Gonzaga Neto","content":"Pessoal, estou com o seguinte problema, talvez alguém já passou por isso: Tenho uma maquina virtual EC2 (Amazon), instalei o Apache2, PHP e MySql, tudo rodando legal. Criei um pequeno site em PHP com formulário de mensagem para encaminhar qualquer sugestão para mim. Para este formulário eu tenho um email criado na RedeHost. Estou tentando usar algum método de envio de email para este site, já tentei a função mail(), tentei o PHPmailer(), estou tentando configurar o SendMail n...a máquina virtual (Ubuntu), tentei configurar com ssmtp, porém até agora não conseguir fazer nenhuma destas alternativas funcionar. O email tem permissão para utilização do smtp, tanto é que utilizo este mesmo email em uma aplicação java. Alguém já se deparou com este cenário? Existe alguma outra alternativa mais simples para configurar o envio de email dentro de uma instancia EC2? Ver mais","datetime":"07/04/2019 00:10"},{"user":"Jonatas Winston","content":"[HELLO WORLD][PLAY STORE] Esse foi meu primeiro app para conhecer a Play Store. >> https://play.google.com/store/apps/details…... Iae galera, qual foi o primeiro app de vocês? Ver mais","datetime":"05/04/2019 23:35"},{"user":"Igor Teixeira Mdeiros","content":"🙃🙃","datetime":"05/04/2019 23:43"},{"user":"Micael Douglas","content":"","datetime":"04/04/2019 10:04"},{"user":"Leonardo Ribeiro","content":"Galera e possível eu exibir os elementos de uma pilha sem remover los?","datetime":"06/04/2019 09:56"},{"user":"Victor Alencar","content":"[OFF] Alguma vez você já se deparou com problemas de atenção/concentração pra resolver problemas ou fazer prova, etc mesmo sem existir um fator que te desconcentre? Como você lida com isso?","datetime":"06/04/2019 16:08"},{"user":"Matheus Nícolas","content":"[Utilidade pública] Boa tarde, fellas. Diversos cursos gratuitos na Data Science Academy (Com certificado)... *Curso Gratuito de Microsoft Power BI (Carga Horária: 54 Horas):* https://www.datascienceacademy.com.br/course… *Curso Gratuito de Fundamentos de Big Data (Carga Horária: 8 Horas):* https://www.datascienceacademy.com.br/course… *Curso Gratuito de Python Fundamentos para Análise de Dados (Carga Horária: 54 Horas):* https://www.datascienceacademy.com.br/course… *Curso Gratuito de Introdução a Ciência de Dados (Carga Horária: 8 Horas):* https://www.datascienceacademy.com.br/course… *Curso Gratuito de Fundamentos de Inteligência Artificial (Carga Horária: 8 Horas):* https://www.datascienceacademy.com.br/course… Ver mais","datetime":"23/03/2019 14:18"},{"user":"João Vitor Andrade","content":"\"O que tá acontecendo nessa linha 180?\"","datetime":"31/03/2019 11:50"},{"user":"Elsio Antunes","content":"Que tá contecendo, meus bacanos?","datetime":"05/04/2019 08:00"},{"user":"William Correa","content":"Boa noite jovens, vocês por acaso teriam algum material tipo fora de série sobre estrutura de dados, listas encadeadas e etc...? lógica ou em C mesmo....eu to decorando como fazer a lista mas não to entendendo é nada ._.\"","datetime":"05/04/2019 04:53"},{"user":"William Okano","content":"[OFF] Java é ótimo, ruim é quem não sabe usar Java. Checked exceptions são lindas e type erasure é a MELHOR coisa da JVM. Java não é \"verboso\", vocês que estão com preguiça de escrever. @edit Haskell é fácil sim! E PHP é ótimo, os bugs são gerados somente pelos programadores, nunca vi linguagem melhor.... Bom, é isso. Ver mais","datetime":"01/04/2019 09:32"},{"user":"Arthur Bueno","content":"[REACT NATIVE]  Alguém tem um tutorial basico pra explicar props/state? Eu procurei algumas aulas e não entendi 100%, ou eu sou mt burro, ou não sei o que é.","datetime":"02/04/2019 16:08"},{"user":"André Rick","content":"galera como resolver problema de cpu e ram em 100% no linux?uso o linux mint 19 tara mate","datetime":"06/04/2019 18:19"},{"user":"Moreira Silva","content":"Ola pessoal boa noite/tarde. Estou fazendo um code bootcamp e gostaria de saber qual o melhor framework para JS no qual eu possa focar? Angular.js Vue.j or React?  Eu vejo muitos falarem que o angular e mais completo e tals. Qual esta mais em alta ai no Brazil? obgd.","datetime":"06/04/2019 21:56"},{"user":"Rafael Luizete","content":"Sujestões de roteadores com suporte a openvpn via ddwrt ou firmware padrão, até uns 200 dinheiros?","datetime":"07/04/2019 00:34"},{"user":"John Tanner","content":"Uma pena não existir uma distro tão foda quanto Deepin mas que não contenha spyware.","datetime":"06/04/2019 00:30"},{"user":"Nzoji Nirav","content":"Pessoal, ajudem aqui por favor. Nunca programei antes, trabalho como técnico de informação (biblioteconomia) já a alguns anos e minha empresa usa muito open source, mas eu gostaria mesmo de aprender desenvolvimento para ser mais completo (saber mais sobre o back end ach que é isso), tenho noção de algoritmos e tal, mas gostaria de saber como começar, qual linguagem preciso aprender primeiro, que matéria estudar. Abcs.","datetime":"06/04/2019 14:29"},{"user":"Joao Cunha","content":"Alguém aqui já trabalhou com sistema SISDEB?","datetime":"06/04/2019 22:43"},{"user":"William Oliveira","content":"Saindo do forno mais uma parte do curso fullstack JavaScript \"Introdução a programação de computadores: paradigmas, identificadores e tipos de dados\"","datetime":"06/04/2019 09:27"},{"user":"Daniel Luna","content":"[OFF]","datetime":"04/04/2019 15:59"},{"user":"Marcos Marm","content":"Qual Linguagem de Programação Vocês recomendam pra começar na programação??Qual Linguagem de Programação Vocês recomendam pra começar na programação??","datetime":"31/03/2019 13:48"},{"user":"Erycky Rayner","content":"Galera,me deem uma ajuda, estou a aprender HTML, CSS e Java Script, ja sei fazer link para outras paginas, botões para outras paginas, sei fazer a estrutura basica de um site de pagina estatica. O que seria util aprender agora?","datetime":"05/04/2019 13:29"},{"user":"Paulino Victorino Balu","content":"No c# como se utiliza o objecto transicion por favor alguem pode me ajudar","datetime":"06/04/2019 16:21"},{"user":"Matias De Freitas Guimarães","content":"Precisava de um jeito rapido e fácil e gratuito de hospedar e visualizar um arquivo HTML que fiz com o Plot.ly para que outras pessoas possam ver. Alguém tem alguma sugestão? Não sei nem onde começar a pesquisar porque não costumo mexer com arquivos do tipo. Talvez algum blog ou medium.","datetime":"06/04/2019 19:13"},{"user":"Daniel Vilarinho","content":"Alguém sabe um corretor de dll que ajeite isso ja tentei o ddll care o dlll suite e não resolveu agradeço desde já","datetime":"06/04/2019 14:38"},{"user":"Miraldino Paulo","content":"[Ajuda] Eae Pessoal alguem sabe como resolver este erro do msfconsole ?","datetime":"05/04/2019 19:55"},{"user":"Rafael Françoso","content":"Programação orientada a choro","datetime":"01/04/2019 18:44"},{"user":"Felipe Franco","content":"Reflexão sobre os motivos dos eventos do Scrum possuírem time-box e a influencia desta limitação de tempo no dia a dia das equipes. https://www.youtube.com/watch… Entre na Lista VIP informando apenas o seu e-mail (link na descrição do vídeo), para receber outras dicas e reflexões!!... Abraço! Ver mais","datetime":"06/04/2019 17:36"},{"user":"Samuel Carvalho","content":"Boa noite, alguém tem ou pode me dizer onde encontrar material de estudo da linguagem R? pode ser em PT ou EN!","datetime":"06/04/2019 01:39"},{"user":"José Elias","content":"Galera, alguém pode me ajudar com isso ? Não sei o que estou fazendo de errado.","datetime":"01/04/2019 11:50"},{"user":"Artur Paiva","content":"Aprendam galerinha, como fazer sistema lixo!","datetime":"30/03/2019 23:08"},{"user":"Lucas Cavallari","content":"Pra quem tem muita saudade do rolê diário...","datetime":"02/04/2019 07:11"},{"user":"Emerson Cortaccio","content":"Galera, uma dúvida. Vou iniciar minha faculdade de Ciências da Computação. Gostaria de saber se nela eu consigo fazer proteção para sistemas, firewalls e criptografias. (Não entendo muito sobre o que faz esse curso, só vou fazer pois minhas condições financeiras não permitem além. Por gentileza, não sejam sarcásticos.)","datetime":"05/04/2019 13:42"},{"user":"Romulo Bittencourt","content":"Boa tarde pessoal. Eu sou formado no Curso de Ciências da Computação em uma Universidade Federal e sou professor de programação. Site... https://escolabrasileiradejogos.netlify.com/ Conteúdo: Ensino a programar com o conteúdo Idêntico da Universidade Federal, disciplina de programação da primeira fase onde a pessoa aprende a programar. Quem desejar fazer aula particular comigo e aprender a programar, fique a vontade para entrar em contato diretamente comigo. Estou atendendo todas as pessoas por voz onde explico tudo sobre as aulas e tiro todas as dúvidas. As aulas são realizadas em tempo real, online comigo em tempo real por voz e video onde a pessoa pode tirar todas as dúvidas e falar com o professor em tempo real durante as aulas. Cordialmente, Romulo Ver mais","datetime":"06/04/2019 15:55"},{"user":"Cristiano De Magalhães Almeida","content":"Em breve vou lançar um curso - Java corporativo em 24 horas. Fiquem ligados!Em breve vou lançar um curso - Java corporativo em 24 horas. Fiquem ligados!","datetime":"01/04/2019 10:06"},{"user":"Elcio Augusto Dalosto","content":"E essa lenda... alguém conhecia?  Terrence Andrew Davis(Terry A. Davis) Eu comecei a ler sobre ele e fiquei cada vez mais curioso porque o cara desenvolveu um sistema operacional sozinho, do zero, que ele mudou de nome várias vezes e acabou finalizando como \"TempleOS\" em cerca de 10 a 12 anos de desenvolvimento.  Era extremamente inteligente(como muitos aqui do grupo), mas ainda jovem foi diagnosticado com transtorno de bipolaridade e posteriormente esquizofrenia.  Era formad...o Mestre em Engenharia Elétrica, e mesmo assim, passou a maior parte da vida desempregado e viveu seus últimos dias na rua, como um sem teto... que história louca. Respeito por esse malucão, falecido ano passado, atropelado por um trem, que dizem ter sido suicídio. Alguns links de referência: https://www.facebook.com/profile.php… https://pt.wikipedia.org/wiki/Terry_A._Davis https://www.templeos.org/… https://www.youtube.com/watch?v=ygZNVbBcJ4I Ver mais","datetime":"05/04/2019 18:59"},{"user":"Eduardo Crepaldi","content":"Olá pessoal, tudo bem? Preciso de uma ajuda de vocês para o meu TCC. Se puderem responder esse meu formulário, estará me ajudando muito no desenvolvimento do TCC. Obrigadão!!","datetime":"06/04/2019 13:41"},{"user":"Sidiney Cassiano","content":"[OFF]Pra playlist de músicas que vocês ouvem enquanto desenvolvem:https://www.youtube.com/watch?v=nSKp2StlS6s...\"you say it works in a restful way, then your errors come back as 200 OK\"  - Isso foi épico kkkkk Ver mais","datetime":"06/04/2019 14:09"},{"user":"Regis Maicon","content":"Galera, para trabalhar com e-commerce qual plataforma vcs me indicam?","datetime":"05/04/2019 11:47"},{"user":"Erick Mendes","content":"O site de uma grande empresa ai, tá com um \"bug\" que expoe os \"contra checks\" de todos os funcionarios, incluindo chefes de setores e chefes de RH... Se eu relatar, tem como pedir uma remuneração? :(","datetime":"04/04/2019 20:51"},{"user":"Vitor Selistre Rosa","content":"[ajuda][html5] quais cursos de HTML5 vocês me indicam ? pode ser no YouTube,udemy etc.. (já assisti do Guanabara no YouTube) obrigado desde já.","datetime":"06/04/2019 13:03"},{"user":"Ludiel Nascimento","content":"Opa, galera. Beleza? Alguém de vocês sabe me dizer como esse site pega os conteúdos de TV por assinatura? https://www.redecanais.click/","datetime":"06/04/2019 13:05"},{"user":"Tiago Mateus","content":"[REACT-NATIVE] Algum ser sabe como resolver isso?","datetime":"04/04/2019 00:02"},{"user":"Igor Chagas","content":"","datetime":"05/04/2019 17:11"},{"user":"Rafaela Soares","content":"VAGA: DESENVOLVEDOR FRONT END JUNIOR Requisitos:   • Superior completo ou último ano em Administração, Análise de Sistemas, Ciências da Computação, Tecnologia da Informação, Engenharia da Computação ou áreas afins; • Imprescindível experiência anterior atuando com HTML5, CSS, Java Script e Vue JS Framework;... • Será considerado como diferencial, o profissional com experiência em Designer e automação de testes.  Contratação: PJ Local: Zona Oeste - São Paulo/SP  Interessados: Enviar CV para analista@radarprofissional.com.br Ver mais","datetime":"04/04/2019 16:29"},{"user":"Francisco Clebio","content":"Desenvolvedores e Devops Aprenda a ser um desenvolvedor \"The Flash\" colocando suas aplicações em funcionamento em poucos minutos, sem precisar se preocupar com servidores, sistemas operacionais e infraestrutura e ainda poder escalar seu ambiente automaticamente conforme a demanda. SÉRIE DE VÍDEOS... DESVENDANDO A AWS CADASTRE-SE:  http://bit.ly/cloud-serieGratis 》》 Ver mais","datetime":"03/04/2019 16:07"},{"user":"Mauro Koder","content":"este programa nao compila com erros alguem pode me ajudar a entender o motivo? #include <iostream> using namespace std;... struct controla {     char nome[50],area_atuacao[50];     float valoratual_acao,valoranterior_acao;     double variacao_acao; }; void preenche(controla ix) {     cout<<\"digite o nome da empresa\"<<endl;         cin.getline(ix.nome,50);     cout<<\"digite a area de atuacao da referida empresa\"<<endl;         cin.getline(ix.area_atuacao,50);     cout<<\"digite o valor atual da acao\"<<endl;         cin>>ix.valoranterior_acao;     cout<<\"digite o valor anterior da acao\"<<endl;         cin>>ix.valoranterior_acao;     cout<<\"digite a variacao da das acoes da empresa\"<<endl;         cin>>ix.variacao_acao;     } void imprime(controla ix)   {      cout<<\"o nome da empresa é:\"<<ix.nome<<endl;     cout<<endl;     cout<<\"a area de atuacao da referida empresa é:\"<<ix.area_atuacao<<endl;     cout<<endl;     cout<<\"o valor atual da acao vale:\"<<ix.valoratual_acao<<endl;     cout<<endl;     cout<<\"o valor anterior da referida acao vale:\"<<ix.valoranterior_acao<<endl;     cout<<endl;     cout<<\"a variacao entre as acoes vale:\"<<ix.variacao_acao<<endl;     }      int main() {     controla iz;     preenche(iz);     imprime(iz);     return 0; } Ver mais","datetime":"05/04/2019 23:55"},{"user":"Gustavo Valeiro","content":"[Gato Sério] Galera qual é a melhor forma de receber dados de um filtro dinamica em uma api rest e fazer a pesquisa no banco de dados, levando em conta que estou utilizando SpringBoot c Spring data. Ex: No sistema frontend tem um formulario para fazer pesquisa filtrando os dados do Funcionario pelos campos de nome, cargo, etc, levando em  conta que o usuario pode prencher quantos campos quiser para pesquisa e o ideia seria que fosse feito tudo numa query só para que a camada de serviços ja receba o resultado paginado do Banco de Dados","datetime":"06/04/2019 10:37"},{"user":"Samuel Oliveira","content":"O primeiro elemento que entra, é o último que sai, Baseado no princípio LIFO ( Last IN, First OUT ), ou o primeiro elemento inserido, será o último retirado. é assim que funciona uma pilha que é o inverso de fila. Os métodos principais de pilha são:... push() para inserir elementos na pilha. top() para acessar elementos inserido na pillha. pop() para retirar um elemento do topo. empty() para verificar se a pilha está vazia ou não. Para mostrar o funcionamento de uma pilha, empilhamos 100 elementos inteiros num vetor, e desempilhamos invertendo a ordem destes elementos. Ver mais","datetime":"06/04/2019 10:37"},{"user":"João Victor","content":"Alguém marca a Quildreen pra ela explicar como é esse problema de maneira mais aprofundada:","datetime":"05/04/2019 21:55"},{"user":"Thiago Alves","content":"qual programa da barra de ferramentas/tarefas vc tem costume de clicar sem querer, e ferrar com tudo?","datetime":"02/04/2019 08:29"},{"user":"Robson Cristian Tomaz Pereira","content":"Eu detesto Java e Portugol! A primeira por ser praticamente uma musculação para os dedos de tão verbosa e a segunda por ser um desserviço para o aprendizado. Que fique claro que essa é a MINHA OPINIÃO.... Se você gosta delas, eu não tenho nada contra você! Não se ofenda! E aí, quais as piores linguagens que você já programaram e por quê? Ver mais","datetime":"30/03/2019 12:34"},{"user":"Lucas Bassotto","content":"Fala pessoal, sei que esse não é o foco do grupo, mas ta acontecendo algo bizarro no meu pc. A tela fica falhando so no Linux. No Windows a tela funciona super bem, não acontece isso em momento algum. Formatei o Linux Mint e reinstalei drivers, mas ainda continua na mesma. Bizarro, não?","datetime":"05/04/2019 12:04"},{"user":"Marcelo Rocha","content":"AWS CLI: Estou googlando, mas parece que não existe uma opção para não sobrescrever arquivos ao utilizar cp NO AWS CLI? Estou fazendo backup de bucket para local, mas isto será recorrente, só que não gostaria de baixar tudo novamente, quero apenas ir complementando.","datetime":"06/04/2019 08:14"},{"user":"Thiago Mari","content":"Eis que quando vais analisar um código, abres um screen action e se depara com este comentário... O que dizer???","datetime":"05/04/2019 06:25"},{"user":"Jefferson Duarte","content":"https://bit.ly/2teViWX","datetime":"06/04/2019 08:49"},{"user":"Joseph Teodoro","content":"https://www.facebook.com/memepicapau/videos/345997209373104/ [OFF] Eis que você é da T.I, mas curte uns memes","datetime":"06/04/2019 07:55"},{"user":"Marcelo Rocha","content":"Galera, algumas perguntas sobre o NodeJS pra salvar um tempo se possível: 1- No Laravel, eu consigo pegar o resultado da consulta e transpilar o nome da colunas com o resources. Ou seja se a coluna se chama NOME_DO_USUARIO eu consigo devolver como userName, e isto pode ser chamado em qualquer parte do projeto. Qual o nome disto em NodeJS? 2- Qual o melhor ORM para consultas em banco de dados, levando em conta tabelas com 200 mil registros e muitos joins? Tanto em velocidade d...e consulta quanto praticidade? 3- Um ORM para consultas já sanitiza os campos para evitar SQL Injection e tudo mais? 4- Qual a forma mais veloz de testar algo após ter salvo o script? PS.: Eu não comecei o curso de NodeJS, é mais para tirar essas dúvidas antes de qualquer coisa... pra não aprender um ORM que de repente não seja bom e jogar tempo fora. Obrigado A.P.D.A! Ver mais","datetime":"03/04/2019 22:58"},{"user":"Allan Alves","content":"","datetime":"05/04/2019 19:46"},{"user":"Victor Maia","content":"[gato sério] [post longo] Vamos falar de jogos! (Jogo é um assunto sério ok.) Já parou para se perguntar por que lutas de jogos são tão meio \"sem graça\" com relação a cenas de animações? Veja, por exemplo, um video de Overwatch, Fortnite, LoL e compare com uma cena de Dragon Ball. Não tem a mesma intensidade, não é mesmo? Mas o que será que está faltando? Eu passei bastante tempo pensando nisso e descobri o culpado: a luz! Isso mesmo. Na maioria dos jogos, efeitos visuais são..., quase sempre, \"locais\": eles não afetam o ambiente ao seu redor, ignorando sua luminosidade inerente. Granadas explodem, fogueiras são acesas, magos lançam raios, anjos esbanjam auras de luz, e, ainda assim, as sombras ao redor continuam do mesmo jeito, como se nada tivesse acontecido! Mesmo em jogos como Breath of the Wild ou Red Dead Redemption, há muitos exemplos disso, o que, pra mim, atrapalha muito a imersão. Já em animações, o contrário acontece. As luzes são exaltadas e exploradas ao máximo. Assista, por exemplo, uma cena onde um Kamehame-ha é lançado. A energia da habilidade libera uma luminosidade tão poderosa que isso afeta tudo ao seu redor, consumindo o ambiente e contribuindo imensamente para a sensação de poder. Outro exemplo disso é o \"Hadashi no Gen\", uma animação que retrata a bomba de Hiroshima. Após a explosão, a cidade é consumida por uma luz tão forte que, por um momento, apenas duas cores podem ser vistas: preto das trevas trevosas, e branco da luz cegante. Mesmo em cenas simples como uma caverna iluminada por uma tocha, a luz nas animações é sempre tão fiel quanto possível. É claro, isso não é por falta de capricho. Luzes são, infelizmente, muito custosas para serem computadas em tempo real. Nem todo mundo tem uma fazenda de placas de video pronta para traçar milhares de raios de luz. Mas nem tudo está perdido! Se você economizar em certas áreas, um jogo com luzes realistas não é impossível. Pensando nisso, eu comecei a fazer um mini-MOBA \"bipolar\": os gráficos, em geral, serão retrô, estilo Tibia, mas, para compensar, a luminosidade será tão realista quanto a de animes. Deste modo, desde uma pequena caverna à luz de tochas, a lutas épicas com explosões monumentais, onde a luz deveria estar, ela estará lá, colaborando com uma experiência imersiva e bem diferente. Por enquanto não tem muita coisa, apenas alguns cubos e bolas, mas foram apenas dois dias de trabalho e estou bem feliz com o progresso atual! Como sempre, o código é 100% open source, feito do zero em puro HTML5/WebGL. Você pode ver como está ficando nesse link: https://maiavictor.github.io/haelin/. Também coloquei um video nesse post. Dependendo do meu ânimo, continuarei trabalhando nisso nos próximos finais de semana. Então me deem seus feedbacks! E isso encerra o conteúdo educacional de hoje. Obrigado e até mais! Ver mais","datetime":"31/03/2019 17:56"},{"user":"Victor Mendonça Nogueira","content":"[off]Será que o termo inteligencia artificial foi dado devido ao fato de parecer que o computador tem alguma inteligencia quando na verdade não passa de um algoritmo que trata cada possível situação de uma forma fazendo com que a inteligencia, na verdade, seja uma burrice artificial? Dissertem.","datetime":"02/04/2019 22:38"},{"user":"Rafael Câmara","content":"","datetime":"06/04/2019 02:09"},{"user":"Alvaro Vasconcelos","content":"https://medium.com/…/melhorando-o-desempenho-do-emulador-an…","datetime":"06/04/2019 02:02"},{"user":"Gabriel Crevelario","content":"Como faço para detectar o device manualmente no android studio porque ele não detecta por nada...","datetime":"06/04/2019 01:12"},{"user":"Fernando Cauper","content":"Uma pergunta acho que até clichê. Qual foi a maior bolsa de estágio pra programador que vocês já viram? Tinha mais algum benefício além da bolsa? Se sim, quais e quais valores?","datetime":"04/04/2019 00:01"},{"user":"Kardrean Shinoda","content":"Alguém por obsequio, sabe como tratar essa imagem pra para ser lida pelo tesseract?","datetime":"04/04/2019 15:12"},{"user":"André Freitas","content":"Começou galera, bora lá.https://codingcompetitions.withgoogle.com/codejam","datetime":"06/04/2019 00:16"},{"user":"Tito Fernando Cazanga","content":"Pessoal preciso da vossa AJUDA O sistema do meu PC parou de fincionar e quero reiniciar mas não tenho cópia de segurança com faço pra reiniciar","datetime":"04/04/2019 17:58"},{"user":"Gabriel Lucas","content":"Boa noite pessoal, Desculpa pela dúvida besta, quero entrar nesse universo de programação. Estou pra entrar numa facul de Análise e desenvolvimento de Sistemas, vale a pena? Ou Sistema da informação é melhor?","datetime":"05/04/2019 23:18"},{"user":"Felipe Brito","content":"Olá galera. Qual é a diferença entre essas duas pós-graduação no infnet? Qual vale a pena fazer? E por que?  (Engenharia de Software x Arquitetura de Software) https://www.infnet.edu.br/…/proposta-pos-graduacao-mit-em-…/... https://www.infnet.edu.br/…/proposta-mit-em-engenharia-de-…/ Ver mais","datetime":"04/04/2019 20:47"},{"user":"Kayenga Campos","content":"","datetime":"30/03/2019 19:18"},{"user":"Fabio Selau","content":"Tenho um site que tem uma api em json. Eu preciso acessar esse site e pegar os valores para exibir. Só com o JS faz isso?","datetime":"04/04/2019 02:23"},{"user":"Ronan Vico","content":"[serious gato] Tenho um ssd 120gb com windows e uns arquivos , se eu comprar um ssd novo , consigo clonar exatamente, tudo trocar os hds e funciona normalmente ? Qual melhor forma de fazer isto ?","datetime":"04/04/2019 09:08"},{"user":"Gabriel Grechuk","content":"[MEIO OFF] [SOFTWARE PARA EDIÇÃO DE VÍDEO] [GATO SÉRIO] Boa tarde pessoal, estou pensando em começa um projeto  que envolve edição de vídeo, mas não to a fim de piratear o Sony Vegas nem o Premiere por questão de preguiça... Sem falar que eu uso Linux na minha máquina Eu sei que o Kdenlive é um excelente editor, mas ele é bem pesado e meu pc da xuxa sofre até pra fazer um simples corte no vídeo... Por isso, eu gostaria de saber se tem alguma alternativa que seja igualmente poderosa aos editores pagos, ou o Kdenlive...  pode ser para Windows também... Des de já, obrigado galera Ver mais","datetime":"04/04/2019 12:20"},{"user":"Felipe Lima","content":"Boa noite, pessoal!  Estamos com vaga de Desenvolvedor Front-End (Html + Css + JS) aqui na Corebiz.  Local: Alphaville - SP Quem tiver interesse, pode mandar currículo para o e-mail: leandro.ramos@corebiz.com.br","datetime":"04/04/2019 19:47"},{"user":"Alisson Custodio","content":"[OFF] [Ajuda] [Kali Linux] Boa noite pessoas, estou tentando ressucitar um computador antigo com ajuda do Linux, fiz um pendrive botavel com a iso do Kali (já testei em outro computador e está funcinado) porém quando eu boto na minha máquina ela simplesmente só abre a Bios mesmo dando prioridade pro pendrive (HD é novo tá sem nada, mas já testei um HD com Win7 e nem o HD abriu). já configurei e reconfigurei a bios várias vezes é até agora nada, alguém sabe me dizer oque posso fazer? Desde já obrigado.","datetime":"04/04/2019 22:30"},{"user":"Joka Malu","content":"Eu controlaria com comandos por voz mesmo :)","datetime":"04/04/2019 11:19"},{"user":"Robson Cristian Tomaz Pereira","content":"Super planilha com todos os cursos gratuitos de desenvolvimento da Udemy: https://robs.cc/planilha-udemy","datetime":"05/04/2019 14:26"},{"user":"Felipe Jardim","content":"Garela, to querendo alternar entre alguns textos pré definidos quando clico em um dos 3 botão disponíveis, tem como fazer isso sem usar JS?código do que eu consegui fazer, coloqueis os \"botões\" num \"input radio\", nisso consigo trocar a cor dos labels, mas ainda não consegui fazer isso funcionar nas divs..  https://codepen.io/Jardim/pen/VNjKXj ","datetime":"05/04/2019 17:24"},{"user":"Alexandre Henrique","content":"Alguém sabe como resolver esse erro? Ao tentar executar um projeto de aplicação web ele informa que o modulo não foi implantado, estou usando atualmente o netbeans na versão 8.2 e a biblioteca que eu utilizei foi o javaee-endorsed-api-7.0, alguma sugestão?","datetime":"05/04/2019 01:47"},{"user":"Filipe Siegrist","content":"Quais as melhores maneiras de se obter um Raspberry Pi? (Me interesso no Zero e no 3).  Me interesso por preços baixos, mas se vcs tiverem algum lugar cujo preço é um pouco maior mas é de confiança, ou entrega rápido, eu aceito sugestões. Podem ser sites, lojas, ou quaisquer dicas.","datetime":"04/04/2019 22:16"},{"user":"Gabrielle Lima Pereira","content":"[dúvida]","datetime":"05/04/2019 13:16"},{"user":"Junior Nunes","content":"Ola Galera preciso de uma ajudinha estou criando um sistema de: Login com Facebook, mas estou enfrentando um probleminha com a Revisão do Aplicativo o Facebook está rejeitando todas as minhas tentativas de permissão para o uso da aplicação USER_POST. Alguém que possa me ajudar? Obrigado","datetime":"05/04/2019 16:59"},{"user":"Paulo Brito","content":"Atenção: ataque aos roteadores #dnshijacking #bancos #uber #roteadores","datetime":"05/04/2019 16:42"},{"user":"Anderson Oliveira de Paula","content":"😯O profissional Fullstack e as suas particularidades. Escute esta entrevista Podcast e Saiba como ser um Fullstack ou se aprimorar nesta profissão que tem garantido bons salários👇 http://bit.ly/entrevista-podcast-fullstack","datetime":"05/04/2019 16:28"},{"user":"Maatheus Asul","content":"Alguém aí sabe se existe um plugin para o atom que consiga exibir o CSS de uma TAG em forma de \"popup\" igual no brackets?","datetime":"05/04/2019 16:03"},{"user":"John Tanner","content":"Pra que tiraram o control+alt+del do ubuntu 18? kd o ifconfig? por isso q é foda usar linux.","datetime":"01/04/2019 19:57"},{"user":"Arion Denovaro","content":"","datetime":"04/04/2019 12:04"},{"user":"Acidiney Dias","content":"Que projecto legal","datetime":"05/04/2019 08:26"},{"user":"Geovane Júnior","content":"[Serious Cat][CoreUI] Galera, tô aprendendo a usar o React e no momento preciso desenvolver um sistema utilizando o CoreUI, mas não tô conseguindo adicionar páginas custom. Eu abro o arquivo index.js (src/index.js) e nele faço o seguinte: import Pagina from './views/Pages/Pagina/'... e depois dentro do ReactDOM.render(<HashRouter><Switch><.../> adiciono o <Route> da página em específico, faço exatamente como nas páginas default do template (Login, Register, etc) mas quando abro o navegador, a tela fica branca (pra qualquer página). Dentro de src/views/Pages eu criei a pasta \"Pagina\" e o arquivo Pagina.js, mas simplesmente depois de eu fazer essa customização a tela fica branca pra qualquer página (até as default). Alguém pra me ajudar nisso? Ver mais","datetime":"05/04/2019 14:39"},{"user":"Jonathan Crístian","content":"[Serius Cat] Pessoal, vim aqui depois de algumas tentativas frustradas com tutoriais a vulso por ai, a minha dúvida é:  Utilizando esta biblioteca no C# e escrevendo o texto para arquivos do tipo Excel, como eu posso ditar que o tipo do valor da minha célula é uma porcentagem?  Alguém já utilizou ela e pode me dar uma mão? ... Agradeço a atenção!! Ver mais","datetime":"05/04/2019 14:40"},{"user":"Yuske Jeager","content":" oláeu to com um probleminha aqui com o unity, eu não sou programador, mas to tentando aprender a criar jogos, e peguei uns excercícios de uma playlist no YT  https://www.youtube.com/playlist?list=PLUur4s1pRGf9jHKo5XAKqP2XyRw35czIK e estou praticando, mas deu um certo problema que não explica qual é, deu 4 erros, mas tem descrição só o horário que ocorreu o problema, será que algum problema no unity ou será que fiz alguma besteira? pq eu ainda não coloquei nenhum scrypt ","datetime":"03/04/2019 15:59"},{"user":"Haans Toon","content":"Pq diabos ter um MACBOOK? Seguinte, tenho quase 10K e queria investir numa máquina que não me desse trabalho ou fosse ficando para trás rapidamente com o passar do tempo. Neste preço encontrei umas configurações de marcas comuns, uma que me chamou a atenção. a Avell com a seguinte configuração:... 32GB d ram DDR4 Optane de 16GB i7 8 geração (acho que o mais recente) Tela de 17 polegadas SSD de 240GB M2 e ainda ganho uns brindes O MAC me chama atenção por: leveza (peso) autonomia da bateria praticidade Mas porra, um MAC com a metade da configuração acima é mínimo 16K quase.  i7 16ram 128ssd 13 polegadas Minha pergunta, realmente o que tem de tão especial em termos UTILITARISTAS que justifiquem o investimento? Alguém poderia dizer os prós e contras de ter um MAC? Eu sou desenvolvedor, trabalho com swift (não com muita frequência), rails, unity3D.  Realmente não consigo ver muita coisa além de status e um design mais compacto, apesar de ter uma certa preferência, pois viajo bastante e um mac ajudaria, principalmente os novos modelos que tem uma autonomia estimada de + de 7^8H. Mas a configuração em si pra mim me incomoda. Ver mais","datetime":"26/03/2019 11:17"},{"user":"Christian Veiga","content":"👔 Vaga: Desenvolvedor Full Stack 💼 Senioridade: Pleno / Senior 🏣 Empresa: Manacá Brasil 📍 Localização: São Paulo 👉 Candidatar: http://bit.ly/manaca_face... 🦊 Quer receber outras vagas de TI? Envie seu currículo para: christian.veiga@vulpi.com.br Ver mais","datetime":"05/04/2019 13:37"},{"user":"André André André","content":"VAGA PARA DESENVOLVEDOR WEB EM BELO HORIZONTE PARA TRABALHAR EM SISTEMA DE INFORMAÇÃO GEOGRÁFICA. NÃO É PARA TRABALHAR REMOTO. http://www.celtica.com.br/vaga.jpg... Envio de currículos para rh@celtica.com.br ;) Ver mais","datetime":"05/04/2019 11:30"},{"user":"Sergio Clemente Da Silva Filho Vitorino","content":"🤙","datetime":"03/04/2019 00:31"},{"user":"Robson Cristian Tomaz Pereira","content":"\"Não me importo em ser um dinossauro na programação desde que eu pague as minhas contas\" Já ouvi essa frase algumas vezes e, no fundo, ela é ao mesmo tempo inteligente e burra. Como assim?... Inteligente porque aprender novas linguagens e técnicas exige esforço e tempo. Claro, quem gosta disso nem vê o tempo passar, mas para quem está acomodado é uma tortura. Ficar \"de boa\" sobra tempo pra fazer muita coisa. E, tempo livre vale muito! Burra porque empresas com dinossauros estão deixando brecha para os concorrentes que possuem stacks* que resolvem melhor** os mesmos problemas. Continuar numa empresa que deixa você se manter no Jurassic Park é uma coisa bastante arriscada. Se ela ir para o buraco, você terá que correr atrás do prejuízo e não será tão fácil. Bem, mas a vida é sua e você decide! Fica a reflexão! * conjunto de tecnologias usada ** mais produtiva, mais confiável... P.S: isso não vale apenas para programadores. Ver mais","datetime":"29/03/2019 10:22"},{"user":"Marcos Borges","content":"","datetime":"05/04/2019 12:32"},{"user":"Paulo Brito","content":"Comprou Xiaomi? Atualize já #xiaomi #celulares #softwaredeseguranca #vulnerabilidades","datetime":"04/04/2019 16:52"},{"user":"Osni Pezzini Junior","content":"Galera , desenvolvo em Python usando PyQt5 .  Minha dúvida é , como você lidam com as licenças , pois uso o open-source , eu sei que a licença permite vender mas preciso expor meu código fonte também ?","datetime":"04/04/2019 17:30"},{"user":"Paul del Cruz","content":"Por favor me ajudem pessoal!  Sempre que estou ligando o meu notebook, ele apenas está a vir escrito: A hibernar (fica a processar) e não vem o ambiente de trabalho.  O que devo fazer?","datetime":"04/04/2019 01:42"},{"user":"Leonardo Ribeiro","content":"Galera tenho uma dúvida , preciso criar uma pilha de 10 elementos que irá armazenar nome, autor e preço e fazer as operações de pilhas(inserir, remover, exibir)  Minha dúvida é, irei fazer um push de todos os elementos da minha struct em uma msm pilha?","datetime":"05/04/2019 08:35"},{"user":"Marlon Ribeiro","content":"Galera, conhecem alguém que tenha feito a pós em Engenharia de Software da Estácio? Preciso saber se vale a pena.","datetime":"05/04/2019 11:57"},{"user":"Luiz Soares","content":"[off-topic] Daqui a 200 anos ainda vamos ter problemas de Injeção de SQL, até nas naves espaciais. Star Trek Discovery, Temporada 2, Episódio 8","datetime":"05/04/2019 08:06"},{"user":"Victor Alves","content":"[OFF] Faltar ; no código é fácil de ver, foda é ficar 2 dias passando ódio e ver que vc colocou = ao invés de ==. TNC .edit [PHP]","datetime":"04/04/2019 16:46"},{"user":"Marcelo Almeida","content":"Qual a melhor linguagem de programação para o mercado brasileiro? Estava pensando em começar por C, para depeois ir pra c#.","datetime":"04/04/2019 10:45"},{"user":"Aniceto José Wylliön","content":"Olá pessoal...  O negócio é o seguinte.  Estou a ter dificuldade em fazer um evento em minha página. ... Evento : no top tem uma imagem e debaixo da imagem fica o menu da página, a medida que eu estiver a rolar pra cima se a imagem que estiver no top da página não estiver mas visível no navegador o menu ficará fixo.  O objectivo do evento é fazer rolar a imagem com o menu juntos e após a imagem não estar mas visível o menu fica fixo no navegador...  Alguém ai pode me ajudar com esse código ou me dar uma ideia pra mim fazer esse evento? Ver mais","datetime":"04/04/2019 20:17"},{"user":"Rogério Mateus Bonfim","content":"alguem usa a heroku? Se sim recomenda usar para app nodejs?","datetime":"04/04/2019 19:53"},{"user":"Fred Nora","content":"Um detalhe sobre kernel que deixará os amantes da portabilidade meio irritados. Estudei bastante nos últimos dias, descobri que falta muita coisa na camada de mais baixo nível do meu kernel e tem que ser feito em Assembly. O kernel do Gramado tem seis arquivos em Assembly para a parte de mais baixo nível da arquitetura IA32. Eu pensava que era muito, mas descobri que não. Pois para cada processador, tem um monte de coisa de baixo nível para ser feito e sempre em Assembly.... Descobri isso olhando muitos sistemas ... todos são assim. Uma parte grande do suporte a taskswitch é feito em Assembly, isso me surpreendeu .... me suspreendeu também que os sistemas usam muito taskswitching via hardware para a arquitetura IA32. Tanto o Windows, quando o Linux fizeram uma transição entre usar taskswitch via hardware para IA32 e usar taskswitch via software ... os dois métodos estão muito conectados ... --- Bom, o que eu queria frizar é que tem muito Assembly na parte mais baixa do kernel e não dá pra fugir disso e para cada processador é uma linguagem Assembly diferente. Veja que não estou falando de HAL ... estou falando da parte de baixo nível do kernel. HAL também é abstração do baixo nível, mas vai além dos componentes do kernel. Ver mais","datetime":"04/04/2019 22:26"},{"user":"Rei Da Uan IV","content":"Porque em toda empresa de tecnologia é necessário ter engenheiros com muitos conhecimentos de matemáticas?","datetime":"04/04/2019 11:02"},{"user":"Matheus Victor","content":"Fala galera! Criei uma interface web para converter JSON para GraphQL Schema. Nada muito complexo, mas está me ajudando bastante a passar APIs REST para o GraphQL","datetime":"02/04/2019 20:20"},{"user":"Gabriel Schnorrenberger","content":"oi galera, então, minha turma ta participando de uma gincana em que uma das provas ganha a turma que tiver mais curtidas em uma foto, vou colocar o link aqui e quem puder curtir eu agradeço  https://m.facebook.com/story.php?story_fbid=2236813819970382&id=100009253571202","datetime":"04/04/2019 22:33"},{"user":"Miguel Ehrlich","content":"Gato da Seriedade Colegas, estou usando o MercadoPago SDK PHP (detro do Laravel) para criar uma assinatura de plano, e após fazer a pré-aprovação do plano, o Mercado Pago deveria me retornar a URL do checkout. O problema é que tanto o init_point quanto o sandbox_init_point retornam o valor protected, ao invés da URL. Como eu poderia resolver? O código que estou usando é exatamente o de exemplo no Git (https://github.com/…/sam…/suscriptions/basic-suscription.php). O access_tok...en está configurado corretamente. Exemplo de retorno (ao dar var_dump em $preapproval_data): https://pastebin.com/H2UP8AKh Ver mais","datetime":"05/04/2019 03:27"},{"user":"Daniel Bonifacio","content":"😳😮 Olha que legal! Eu ensinei a criar um cluster do MongoDB com o Atlas e a conectar isso na nossa aplicação do Te Emprego com mongoose... 30 minutos de aula!... https://youtu.be/qjdBNed6AUs Ver mais","datetime":"05/04/2019 04:07"},{"user":"Erick Wendel","content":"E hoje é dia por aqui! Bora mostrar umas mágicas no VSCode \\o/ #mvpbr #nodebr #jssp #nerdzao #googledevexpert","datetime":"04/04/2019 16:46"},{"user":"Wesley Prado","content":"Pessoal, boa noite, quais os melhores sites para freelancer na opinião de vocês?","datetime":"04/04/2019 23:23"},{"user":"Tiago Vieira","content":"Então eu tenho que aprender Kotlin para um trabalho que eu tenho que fazer porém não tem muita coisa no Youtube Alguém sabe de algum curso online para me ajudar pfv?","datetime":"04/04/2019 17:00"},{"user":"Fabricio Vergara","content":"Empresa onde trabalho esta procurando mid/senior android Dev com experiência com eletrônica, c/cpp, jni, kernel para Hardware team. Vaga ta aberta ja um tempo e ta começando a ficar urgente. Local Stockholm, pagam visto, assistência de imigraçao, bom work-life balance, varios beneficios.... Mais informações comments ou pm. Ver mais","datetime":"05/04/2019 02:23"},{"user":"Maatheus Asul","content":"alguem consegue me ajudar com dev web? tentei criar um botao simples pra redirecionar a outra pagina na mesma janela mas ao clicar no botao nada acontece. testei a função chamada pro redirecionamento com outros comandos e funcionam tranquilo como por exemplo o comando btn.disabled=true; codigo do botao:...   <input type=\"button\" name=\"switch\" onClick=\"action()\" value=\"switch\">       <script type=\"text/javascript\">         function action()         {           window.location=\"ho.html\";         }       </script> Ver mais","datetime":"05/04/2019 01:45"},{"user":"Rafael Bazanella","content":"alguém tem aquela tirinha sobre diferentes bancos de dados, comparados com cavalos? preciso muito dela! 😂","datetime":"04/04/2019 17:37"},{"user":"Mauricio Dantas","content":"Uma pessoa já fez projetos com WPF, ASP Net MVC, ASP Net Core, Xamarin, Ionic, Angular e sabe um pouco de PHP e agora ta estudando Flutter... o que ela deve fazer para tentar uma oportunidade no mercado depois de 3 meses parada? se aperfeiçoar em algo que ela ja sabe ou aprender algo que ainda não usou ou usa pouco como PHP, Android Studio, Node JS...?","datetime":"04/04/2019 18:43"},{"user":"Jïmmÿ Ginga","content":"[Help] É possivel fazer um projecto (um sistema web por exemplo) usando duas ou mais linguagens de programação? E em que circunstâncias usar? Que não sejam necessariamente php e javascript, mas php e c# ou php e Python (django)?","datetime":"04/04/2019 17:09"},{"user":"Carlos Lima","content":"Artigo interessante. Vale a pena conferir! #TI","datetime":"05/04/2019 00:31"},{"user":"Kevin C. Primo","content":"Bom dia! Sou, literalmente, um programador depressivo.  tenho passado por muito coisa na minha vida e por consequência tem afetado meu desempenho na faculdade.  Pra resumir, estou estagnado e não consigo passar em processos seletivos de estágio.  O que vcs recomendam para um jovem como eu desesperado que nunca conseguiu um estágio e anseia muito por um?... Ps. tô quase trancando por causa disso. Ver mais","datetime":"02/04/2019 06:14"},{"user":"Gabriel Santos","content":"Galera, boa noite. Alguém alguma vez na vida já teve que fazer uma API usando o IBM informix? Estou passando um aperto com isso e não tenho mais ideias de como seguir a diante, vou explicar o caso: Estou criando uma WEBAPI em .NET que sua unica função é me retornar dados de Selects.... Quando eu executo a aplicação via debug e testo com o postman, a requisição é enviada e é executado o select que preciso ( o banco de dados em questão esta hospedado em outro servidor). O meu problema está ao publicar essa aplicação no IIS até onde eu consegui entender ele não consegue abrir a conexão com o servidor que está localizado o banco, já testei em servidores que contem outras aplicações que acessam o mesmo banco de dados, dei as permissões de acesso e mesmo assim a minha aplicação não funciona. Alguém já passou por esse problema? Ver mais","datetime":"04/04/2019 23:57"},{"user":"Diogo Malkiaver","content":"Como terminar o curso de ciências da computação detestando 40% da grade? Eu odeio teoria da computação, matemática discreta, computação gráfica, processamento de imagens, Projeto e Análise de Algoritmos e Compiladores. Como estudar estas matérias de modo que eu não fique dormindo nos 10 primeiros minutos e tenha pensamentos suicidas ou vontade de desistir do curso?","datetime":"30/03/2019 17:23"},{"user":"Cristopher Andrade","content":"","datetime":"04/04/2019 23:45"},{"user":"Felippe Longo","content":"[OFF]Vim de longe. E trago verdades #paz","datetime":"03/04/2019 11:12"},{"user":"Lz Cristino","content":"Olá, Trabalho com um CMS e ele monta uma tag <form> no código fonte. Isso tá me causando problema porque está tirando 1 ponto e meio de nota de acessibilidade. Alguém tem uma boa ideia pra resolver o problema ou mascarar esse cara? Ia tentar com js, mas penso que ele vai rodar só depois né, o que acaba por não resolver o problema antes que a nota seja gerada :(","datetime":"04/04/2019 09:34"},{"user":"Marcelo Rocha","content":"Ela morreu. E com ela, um pedaço de nós. Obrigado por tudo cafeteira!","datetime":"02/04/2019 10:17"},{"user":"Moreira Silva","content":"O quão ninja você irá ficar se fizer um projeto por dia, durante sete meses. ","datetime":"04/04/2019 22:04"},{"user":"Gabriel Ferreira","content":"Gravamos um podcast onde debatemos sobre duas das tecnologias mais populares dos últimos tempos: Angular e React! Escuta aí: ","datetime":"02/04/2019 15:02"},{"user":"Paulo Brito","content":"Espionagem de verdade #espionagem #hackers #china #winnti #bayer","datetime":"04/04/2019 21:50"},{"user":"Lucas Cavallari","content":"Cada npm install  é uma árvore.,kkkk","datetime":"04/04/2019 07:15"},{"user":"Vitor Pereira","content":"Depois \"Android: Como Programar\" e \" Google Android\" Qual  livro de programaçao android você recomenda?","datetime":"04/04/2019 20:39"},{"user":"Rodrigo Medeiros Lehnemann","content":"[ASP.NET + Ubuntu 18.04 - SOLVED] Pessoal estou usando o Monodevelop no Ubuntu 18.04 para compilar o código mais base do ASP.NET,  no entanto estou encontrando o seguinte erro:  /usr/share/dotnet/sdk/2.2.202/Sdks/Microsoft.NET.Sdk/targets/Microsoft.NET.Sdk.targets(5,5): Error MSB4018: Falha inesperada da tarefa \"GenerateDepsFile\". System.TypeLoadException: Could not load type of field 'Microsoft.NET.Build.Tasks.DependencyContextBuilder:_filteredPackages' (12) due to.... Alguém sabe me dizer como resolver? Ver mais","datetime":"03/04/2019 21:37"},{"user":"Matheus Budkewicz Battisti","content":"Fala galera, beleza? Continuando os vídeos de Django agora veremos as famosas classes de formulário, e então vamos criar um form para inserir dados no banco pelo front-end da aplicação! :D Link: https://www.youtube.com/watch?v=la_MTnWEBMM","datetime":"04/04/2019 21:07"},{"user":"Payno","content":"Olá, estou criando um jogo de plataforma 2D na unity e queria colocar uma mecânica que quando o jogador pressionasse e segurasse o botão 'espaço' o personagem começaria a voar, porém sou iniciante e não faço a minima ideia como implementar isso junto com as outras teclas de ação do personagem, não sei como postar meu código aqui, mas caso alguem consiga me ajudar ou tenha alguma dica, o link do stackoverflow pra ver o codigo ","datetime":"04/04/2019 21:01"},{"user":"Adriana Luterio","content":"Senhores(as) alguém sabe como desativar os comentários do Facebook Watch?","datetime":"04/04/2019 20:56"},{"user":"Matheus Alves","content":"(OFF) Existe algum suporte pra deixar um hd externo tipo grudado no notebook? Tipo pra eu nao perder. Pra ele ficar sempre junto do notebook. Se sim, onde vende?","datetime":"04/04/2019 18:33"},{"user":"Wizzi Nuixx","content":"alguém é assinante dev media?  quero fazer 1 único curso lá, mas eles não vendem separadamente se alguém tiver e puder eu pago para fazer o curso. obrigado","datetime":"04/04/2019 20:16"},{"user":"Lenah Sakai","content":"[Call 4 Papers] Quer ministrar uma palestra ou uma oficina na Virada Tecnológica São Paulo 2019? Chegou a hora! :-) Acesse nosso formulário, entenda como funciona e submeta sua atividade! Segue: http://bit.ly/call4papersvirada #Call4Papers","datetime":"04/04/2019 19:06"},{"user":"Ytalo Simôa","content":"Lá vem \"bug do milênio?\"  Info do FAA informando da reinicialização do relogio do GPS no dia 6 de abril, nesse domingo é possível  que haja problema no uso de GPS neste dia ou no dia seguinte.","datetime":"04/04/2019 18:19"},{"user":"Gabriel Maia","content":"Preciso de ajuda para meu projeto de TCC. É basicamente um gatinho que fala e interage com crianças (para ajudar em tratamentos), claro que com certas limitações.  O ponto é: ... A) Uso arduíno e me fodo para programar tudo legalzinho B) Uso algo tipo raspaberry com uma API em python legal, mas me fodo para fazer o gato falar.  Also, alguém indica algo que possa sanar, ou pelo menos nortear melhor o projeto?  (robô que dança da Havan meramente ilustrativo) Ver mais","datetime":"02/04/2019 20:37"},{"user":"Matheus Boldrini","content":"Estou fazendo um curso de React + redux no udemy, de um professor bem conceituado, mas será que foi só eu que achei isso tudo uma m****?  muito código digitado p/ coisas simples, e qualquer coisa diferente, tem que instalar uma porrada de plugins, pqp....","datetime":"04/04/2019 17:22"},{"user":"Matheus Prado","content":"[Off] Pessoal venho até vocês para deixar a parte de um projeto que acredito ser útil. https://github.com/…/wi…/blob/master/Winged/Utils/Vector.php... A classe do link implementa as interfaces ArrayAccess e Iterator. Uma instancia dessa classe pode utilizar normalmente as sintaxes de um array nativo como. foreach($vector as $key => $value){ } echo $vector[0]; $vector[] = 'foo'; $vector['bar'] = 'foo'; E permite algo inspirado na classe já existe SplObjectStorage disponível desde PHP 5.3. $std = new stdClass(); $vector[$std] = 'this position contains an key = object'; $vector[['iam an array']] = 'this position contains an key = array' Ver mais","datetime":"04/04/2019 17:13"},{"user":"Manuel Viana Gege","content":"Pessoal do Haskell gostaria de saber quando é que aplica_se a condição de uma determinada função?  Ex: drop(dobro(dobro 2))[1.....10] Agradecia a vossa explicação. ...","datetime":"04/04/2019 17:10"},{"user":"Elsio Antunes","content":"Como eu faço pra impedir que o Android abaixe o volume automaticamente toda hora? Que raiva! Celular no bolso, tenho que ficar aumentando pq ele abaixa é exibe uma mensagem de proteção dos meus ouvidos.","datetime":"04/04/2019 16:25"},{"user":"Luciana Ribeiro","content":"[HELP] Boa Tarde,Como faço para  desenvolver uma comera que reconheça veículos e envie a placa para um celular ou email?(pfv n me julguem),manjo um pouco de C e estudo embedded systems!","datetime":"04/04/2019 16:09"},{"user":"Salomão Ziloy Zinho Principe Zinho","content":"","datetime":"04/04/2019 16:12"},{"user":"Anderson Oliveira de Paula","content":"😯O profissional Fullstack e as suas particularidades. Escute esta entrevista Podcast e Saiba como ser um Fullstack ou se aprimorar nesta profissão que tem garantido bons salários👇 http://bit.ly/entrevista-podcast-fullstack","datetime":"04/04/2019 16:09"},{"user":"Thauana Teles","content":"Esta dando este erro no ELSE, não sei o que pode ser, alguém pode me ajudar?","datetime":"02/04/2019 00:40"},{"user":"Gabriel Ferreira","content":"Lançamos hoje o primeiro episódio do Hipsters Ponto Tube, a nova websérie da Alura ;) Nessa primeira temporada, iremos sanar as grandes dúvidas do profissional de tecnologia, começando por Data Science: https://www.youtube.com/watch?v=5b9Z8toVaAU","datetime":"03/04/2019 23:21"},{"user":"Lucas Juliao","content":"Galera, tenho um site que já está no ar na plataforma wordpress, ai se eu exportar e importar esse site em outra acc wordpress, o site que está no ar vai continuar né?","datetime":"04/04/2019 14:05"},{"user":"Christian Veiga","content":"👔 Vaga: Analista Programador 💼 Senioridade: Pleno 🏣 Empresa: SML Brasil 📍 Localização: São Paulo 👉 Candidatar: http://bit.ly/sml1_face... 🦊 Deseja receber outras vagas? Envie seu currículo para: christian.veiga@vulpi.com.br Ver mais","datetime":"04/04/2019 14:25"},{"user":"Guilherme Menezes Ferreira","content":"Alguem sabe me informar onde encontro material para desenvolvimento de terminais P.O.S. Procurei no Google e não encontrei nada que me dê uma noção. Obrigado.","datetime":"04/04/2019 14:12"},{"user":"Cristiano De Magalhães Almeida","content":"Pra quem está estudando e tem curiosidade sobre o dia a dia numa empresa: No momento estou em um projeto como desenvolvedor full stack em uma arquitetura com front end angular e backend com microserviços usando Java (Spring Boot). No front end meu trabalho consiste basicamente em alterar posições, cores e comportamento de botões que enviam dados para os serviços....Continuar lendo","datetime":"03/04/2019 15:20"},{"user":"Daniel Brito","content":"Boa tarde amigos, preciso da vossa ajuda. algo estranho aconteceu em meu computador. o visor do meu computador portatil ia diminuindo a luz do fundo de tempo em tempo, agora por hoje a luz diminuiu que praticamente nao consigo utilizar, alguem sabe ou ja passou essa situaçao? quero saber se ainda tenho uma esperança se ainda ha uma soluçao.","datetime":"04/04/2019 12:23"},{"user":"Guilherme Sorbello","content":"Trampo com redes, mas pra fazer um site uso um template pronto tipo HTML5 UP e edito, ta valendo?Trampo com redes, mas pra fazer um site uso um template pronto tipo HTML5 UP e edito, ta valendo?","datetime":"03/04/2019 02:17"},{"user":"Bieel Ribeiro","content":"Galera, um BOT(A maquina) de Jogos e tudo mais. Pode ser considerado uma I.A?(Inteligencia Artificial)","datetime":"02/04/2019 19:16"}]